{"id":16115808,"name":"Sequential Monitoring of Response-Adaptive Randomized Clinical Trials","abstraction":"For many clinical trials interim analyses are undertaken periodically, one purpose being to determine whether to stop the trial early because of a substantial treatment difference. There exist group sequential designs for such trials, on simple approach being to decide in advance on a maximum number of analyses and then to apply repeated significance tests to the accumulating data. To allow for repeated testing one uses a more stringent (nominal) significance level as a stopping rule. Power calculations based on results for normal group sequential designs obtained by numerical integration, enable one to determine the number of patients to be evaluated between analyses. There appears to be little advantage in analysing trial data on more than five occasions unless one anticipates the possibility of an extremely large treatment difference. As an alternative to having a constant nominal significance level throughout a trial, one could have more stringent significance levels at early stages and less stringent levels at the last one or two analyses. For a trial of adequate overall size and power there appears to be no statistical advantage to be gained from this approach.","authors":[],"citedInUrls":["https://www.researchgate.net/publication/47451734_Sequential_Monitoring_of_Response-Adaptive_Randomized_Clinical_Trials","https://www.researchgate.net/publication/245495899_Editor%27s_Special_Invited_Paper_Second-Guessing_Clinical_Trial_Designs","https://www.researchgate.net/publication/1901862_Asymptotically_optimal_multistage_tests_of_simple_hypotheses"],"refrenceUrls":["https://www.researchgate.net/publication/18576054_Statistics_The_Problem_of_Examining_Accumulating_Data_More_Than_Once","https://www.researchgate.net/publication/216300067_Repeated_Significance_Tests_on_Accumulating_Data","https://www.researchgate.net/publication/22645622_A_Multiple_Test_Procedure_for_Clinical_Trials","https://www.researchgate.net/publication/30975436_Group_Sequential_Methods_in_the_Design_and_Analysis_of_Clinical_Trials"],"citedInIDs":[47451734,245495899,1901862],"refrenceIDs":[18576054,216300067,22645622,30975436],"pageRank":9.178696393247307E-4}
