{"id":16454080,"name":"Manual blood exchange transfusion does not significantly contribute to parasite clearance in artesunate-treated individuals with imported severe Plasmodium falciparum malaria","abstraction":"Individual pharmacokinetic parameters can be viewed as independent realizations of a random variable. The probability density function of the variable is assumed to be specified by its first two moments (mean vector and covariance matrix), and these moments then characterize the distribution of the parameters in the population. The following methods are presented for estimation of population characteristics from a set of pharmacokinetic measurements in a sample of subjects: The Global Two-Stage Approach (GTS) uses estimates (and their covariances) of individual parameters obtained after separate fitting of each individual\u0027s data. The Iterated Two-Stage Approach (ITS) makes the GTS procedure iterative, using refined bayesian estimates of individual parameters at each step. The Nonlinear Filtering Approach (NLF) also relies on individual parameter estimates produced by using an optimal filter on each subject\u0027s data. The three methods give exact results (maximum likelihood estimates), as does NONMEM (the Nonlinear Mixed-Effect Model Approach), when the individual pharmacokinetic model is linear with respect to the parameters and when the distributions of the pharmacokinetic parameters and of the measurement noise in the individual data are both multivariate normal. When the individual pharmacokinetic model is statistically nonlinear (the usual case), the methods differ with respect to: (1) their strategy for handling nonlinearity, (2) their ability to deal with any type of data (experimental and/or routine), and (3) their sensitivity to the amplitude of random effects. With regard to computational aspects, both the computer memory storage requirements and the amount of computation required for the GTS approach are much smaller than for the three other methods. Contrasting considerations as well as results of simulations suggest that GTS, ITS, and, in future, NLF may be valuable alternatives to NONMEM or modifications of it for estimation of population characteristics of pharmacokinetic parameters.","authors":["Alain Mallet","J F Boisvieux"],"citedInUrls":["https://www.researchgate.net/publication/236088625_Manual_blood_exchange_transfusion_does_not_significantly_contribute_to_parasite_clearance_in_artesunate-treated_individuals_with_imported_severe_Plasmodium_falciparum_malaria","https://www.researchgate.net/publication/51686652_Investigations_of_a_compartmental_model_for_leucine_kinetics_using_nonlinear_mixed_effects_models_with_ordinary_and_stochastic_differential_equations","https://www.researchgate.net/publication/7616257_Reduced_sampling_schedule_for_the_glucose_minimal_model_Importance_of_Bayesian_estimation"],"refrenceUrls":["https://www.researchgate.net/publication/22228838_Estimation_of_Population_Characteristics_of_Pharmacokinetic_Parameters_from_Routine_Clinical_Dat","https://www.researchgate.net/publication/18532643_Modelling_of_Individual_Pharmacokinetics_for_Computer-Aided_Drug_Dosage","https://www.researchgate.net/publication/22228842_Curve_fitting_modelling_in_pharmacokinetics_and_some_practical_experiences_with_NONLIN_and_a_new_program_FUNFIT","https://www.researchgate.net/publication/227288085_Nonlinear_least-squares_regression_programs_for_microcomputers","https://www.researchgate.net/publication/18039774_Problems_associated_with_analysis_of_pharmacokinetic_models","https://www.researchgate.net/publication/18739228_Statistical_Estimations_in_Pharmacokinetics","https://www.researchgate.net/publication/225262886_A_priori_Lithium_Dosage_Regimen_Using_Population_Characteristics_of_Pharmacokinetic_Parameters"],"citedInIDs":[236088625,51686652,7616257],"refrenceIDs":[22228838,18532643,22228842,227288085,18039774,18739228,225262886],"pageRank":6.235205544854544E-4}
