{"id":221497328,"name":"Randomized Allocation With Arm Elimination in A Bandit Problem with Covariates","abstraction":"Considering one-dimensional continuum-armed bandit problems, we propose an improvement of an algorithm of Kleinberg and a new set of conditions which give rise to improved rates. In particular, we introduce a novel assumption that is complementary to the previous smoothness conditions, while at the same time smoothness of the mean payoff function is required only at the maxima. Under these new assumptions new bounds on the expected regret are derived. In particular, we show that apart from logarithmic factors, the expected regret scales with the square-root of the number of trials, provided that the mean payoff function has finitely many maxima and its second derivatives are continuous and non-vanishing at the maxima. This improves a previous result of Cope by weakening the assumptions on the function. We also derive matching lower bounds. To complement the bounds on the expected regret, we provide high probability bounds which exhibit similar scaling.","authors":[],"citedInUrls":["https://www.researchgate.net/publication/289530299_Randomized_Allocation_With_Arm_Elimination_in_A_Bandit_Problem_with_Covariates","https://www.researchgate.net/publication/283268457_Kernel_Estimation_and_Model_Combination_in_A_Bandit_Problem_with_Covariates","https://www.researchgate.net/publication/267515321_Optimal_WiFi_Sensing_via_Dynamic_Programming"],"refrenceUrls":["https://www.researchgate.net/publication/220343796_Finite-time_Analysis_of_the_Multiarmed_Bandit_Problem","https://www.researchgate.net/publication/221617828_Nearly_Tight_Bounds_for_the_Continuum-Armed_Bandit_Problem","https://www.researchgate.net/publication/3085462_Minimizing_Regret_With_Label_Efficient_Prediction","https://www.researchgate.net/publication/247818713_The_Continuum-Armed_Bandit_Problem"],"citedInIDs":[289530299,283268457,267515321],"refrenceIDs":[220343796,221617828,3085462,247818713],"pageRank":6.563558296052692E-4}
