{"id":221606462,"name":"Exploiting Uniform Assignments in First-Order MPE","abstraction":"It is often convenient to represent probabilistic mod- els in a first-order fashion, using logical atoms such as partners(X,Y ) as random variables parameterized by log- ical variables. (de Salvo Braz, Amir, \u0026 Roth 2005), follow- ing (Poole 2003), give a lifted variable elimination algorithm (FOVE)for computing marginal probabilities from first-order probabilistic models (belief assessment, or BA). FOVE is lifted because it works directly at the first-order level, elimi- nating all the instantiations of a set of atoms in a single step, in some cases independently of the number of these instan- tiations. Previous work could treat only restricted potential functions. There, atoms\u0027 instantiations cannot constrain each other: predicates can appear at most once, or logical variables must not interact across atoms. In this paper, we present two contributions. The first one is a significantly more general lifted variable elimination algorithm, FOVE-P, that covers many cases where atoms share logical variables. The second contribution is to use FOVE-P for solving the Most Probable Explanation (MPE) problem, which consists of calculating the most probable assignment of the random variables in a model. The transition from BA to MPE is straightforward in propositional models, but the lifted first-order case is harder. We introduce the notion of lifted assignments, a distribution of values to a set of random variables rather than to each indi- vidual one. Lifted assignments are cheaper to compute while being as useful as regular assignments over that group. Both contributions advance the theoretical understanding of lifted probabilistic inference.","authors":[],"citedInUrls":["https://www.researchgate.net/publication/232275972_Exploiting_Uniform_Assignments_in_First-Order_MPE","https://www.researchgate.net/publication/224943862_Bisimulation-based_Approximate_Lifted_Inference","https://www.researchgate.net/publication/224943883_Counting_Belief_Propagation"],"refrenceUrls":["https://www.researchgate.net/publication/221475022_Bayesian_Logic_Programs","https://www.researchgate.net/publication/32964812_Lifted_First-Order_Probabilistic_Inference","https://www.researchgate.net/publication/222714823_Handbook_of_Mathematical_Function_With_Formulas_Graphs_and_Mathematical_Tables","https://www.researchgate.net/publication/2517077_Bucket_Elimination_A_Unifying_Framework_for_Reasoning","https://www.researchgate.net/publication/2417508_Probabilistic_Frame-Based_Systems","https://www.researchgate.net/publication/2338139_Probabilistic_Logic_Programming_and_Bayesian_Networks","https://www.researchgate.net/publication/220485797_Bayesian_Logic_Programs","https://www.researchgate.net/publication/220813165_Lifted_First-Order_Probabilistic_Inference","https://www.researchgate.net/publication/222463346_Probabilistic_logic_programming","https://www.researchgate.net/publication/215990907_Markov_Logic_Networks"],"citedInIDs":[232275972,224943862,224943883],"refrenceIDs":[221475022,32964812,222714823,2517077,2417508,2338139,220485797,220813165,222463346,215990907],"pageRank":6.299832703772811E-4}
