{"id":225248652,"name":"Degradation data analysis for samples under unequal operating conditions: a case study on train wheels","abstraction":"Individual pharmacokinetic parameters quantify the pharmacokinetics of an individual, while population pharmacokinetic parameters quantify population mean kinetics, interindividual variability, and residual intraindividual variability plus measurement error. Individual pharmacokinetics are estimated by fitting individual data to a pharmacokinetic model. Population pharmacokinetic parameters are estimated either by fitting all individual\u0027s data together as though there were no individual kinetic differences (the naive pooled data approach), or by fitting each individual\u0027s data separately, and then combining the individual parameter estimates (the two-stage approach). A third approach, NONMEM, takes a middle course between these, and avoids shortcomings of each of them. A data set consisting of 124 steady-state phenytoin concentration-dosage pairs from 49 patients, obtained in the routine course of their therapy, was analyzed by each method. The resulting population parameter estimates differ considerably (population mean Km, for example, is estimated as 1.57, 5.36, and 4.44 g/ml by the naive pooled data, two-stage, and NONMEM approaches, respectively). Simulations of the data were analyzed to investigate these differences. The simulations indicate that the pooled data approach fails to estimate variabilities and produces imprecise estimates of mean kinetics. The two-stage appproach produces good estimates of mean kinetics, but biased and imprecise estimates of interindividual variability. NONMEM produces accurate and precise estimates of all parameters, and also reasonable confidence intervals for them. This performance is exactly what is expected from theoretical considerations and provides empirical support for the use of NONMEM when estimating population pharmacokinetics from routine type patient data.","authors":["Lewis B. Sheiner","Stuart L. Beal"],"citedInUrls":["https://www.researchgate.net/publication/263139727_Degradation_data_analysis_for_samples_under_unequal_operating_conditions_a_case_study_on_train_wheels","https://www.researchgate.net/publication/46541220_Stochastic_Differential_Mixed-Effects_Models","https://www.researchgate.net/publication/23963684_Evaluation_of_modeling_procedure_for_fitting_in_situ_feed_degradation_profiles"],"refrenceUrls":["https://www.researchgate.net/publication/216300357_%27A_Note_on_Generation_of_Normal_Deviates%27","https://www.researchgate.net/publication/13397905_A_Study_of_the_Pharmacokinetics_of_Phenytoin_Diphenylhydantoin_in_Epileptic_Patients_and_the_Development_of_a_Nomogram_for_Making_Dose_Increments","https://www.researchgate.net/publication/25308228_Introduction_to_Statistical_Analysis","https://www.researchgate.net/publication/22315770_Micro-determination_of_plasma_diphenylhydantoin_by_gas-liquid_chromatography","https://www.researchgate.net/publication/15760308_Predictability_of_Phenytoin_Serum_Levels_by_Nomograms_and_Clinicians","https://www.researchgate.net/publication/15848339_On_the_stochastic_modeling_of_tracer_kinetics","https://www.researchgate.net/publication/22316587_Individualization_of_phenytoin_dosage_regimen","https://www.researchgate.net/publication/22675201_Forecasting_Individual_Pharmacokinetics","https://www.researchgate.net/publication/23083654_Serum-phenytoin_levels_in_management_of_epilepsy","https://www.researchgate.net/publication/22228838_Estimation_of_Population_Characteristics_of_Pharmacokinetic_Parameters_from_Routine_Clinical_Dat"],"citedInIDs":[263139727,46541220,23963684],"refrenceIDs":[216300357,13397905,25308228,22315770,15760308,15848339,22316587,22675201,23083654,22228838],"pageRank":6.235205544854544E-4}
