{"id":2342884,"name":"Foreign Exchange Rates Forecasting with Multilayer Perceptrons Neural Network by Bayesian Learning","abstraction":". Empirically assessing the predictive performance of learning methods is an essential component of research in machine learning. The DELVE environment was developed to support such assessments. It provides a collection of datasets, a standard approach to conducting experiments with these datasets, and software for the statistical analysis of experimental results. In this paper, DELVE is used to assess the performance of neural network methods when the inputs available to the network have varying degrees of relevance. The results confirm that the Bayesian method of \"Automatic Relevance Determination\" (ARD) is often (but not always) helpful, and show that a variation on \"early stopping\" inspired by ARD is also beneficial. The experiments also reveal some other interesting characteristics of the methods tested. This example illustrates the essential role of empirical testing, and shows the strengths and weaknesses of the DELVE environment. 1 Introduction This paper has two purposes: To ...","authors":["Radford M. Neal"],"citedInUrls":["https://www.researchgate.net/publication/224346924_Foreign_Exchange_Rates_Forecasting_with_Multilayer_Perceptrons_Neural_Network_by_Bayesian_Learning","https://www.researchgate.net/publication/51413801_Electromagnetic_source_reconstruction_for_group_studies","https://www.researchgate.net/publication/5850032_Multiple_sparse_priors_for_the_MEGEEG_inverse_problem"],"refrenceUrls":["https://www.researchgate.net/publication/30771436_MacKay_DJC_A_Practical_Bayesian_Framework_for_Backprop_Networks_Neural_Computation_43_448-472","https://www.researchgate.net/publication/266248467_BAYESIAN_LEARNING_FOR_NEURAL_NETWORKS_Bayesian_Learning_for_Neural_Networks","https://www.researchgate.net/publication/223618161_Improving_Model_Selection_by_Nonconvergent_Methods","https://www.researchgate.net/publication/246294453_General_averaging_results_for_convex_optimization"],"citedInIDs":[224346924,51413801,5850032],"refrenceIDs":[30771436,266248467,223618161,246294453],"pageRank":8.969342046448317E-4}
