{"id":239524417,"name":"Exploiting Multi-Core Architectures for Reduced-Variance Estimation with Intractable Likelihoods","abstraction":"A general scheme to exploit Exact-Approximate MCMC methodology for intractable likelihoods is suggested. By representing the intractable likelihood as an infinite Maclaurin or Geometric series expansion, unbiased estimates of the likelihood can be obtained by finite time stochastic truncations of the series via Russian Roulette sampling. Whilst the estimates of the intractable likelihood are unbiased, for unbounded unnormalised densities they induce a signed measure in the Exact-Approximate Markov chain Monte Carlo procedure which will introduce bias in the invariant distribution of the chain. By exploiting results from the Quantum Chromodynamics literature the signed measures can be employed in an Exact-Approximate sampling scheme in such a way that expectations with respect to the desired target distribution are preserved. This provides a general methodology to construct Exact-Approximate sampling schemes for a wide range of models and the methodology is demonstrated on well known examples such as posterior inference of coupling parameters in Ising models and defining the posterior for Fisher-Bingham distributions defined on the $d$-Sphere. A large scale example is provided for a Gaussian Markov Random Field model, with fine scale mesh refinement, describing the Ozone Column data. To our knowledge this is the first time that fully Bayesian inference over a model of this size has been feasible without the need to resort to any approximations. Finally a critical assessment of the strengths and weaknesses of the methodology is provided with pointers to ongoing research.","authors":["Anne-Marie Lyne","Heiko Strathmann","Daniel Simpson","Yves Atchade"],"citedInUrls":["https://www.researchgate.net/publication/264936676_Exploiting_Multi-Core_Architectures_for_Reduced-Variance_Estimation_with_Intractable_Likelihoods","https://www.researchgate.net/publication/273640222_Light_and_Widely_Applicable_MCMC_Approximate_Bayesian_Inference_for_Large_Datasets","https://www.researchgate.net/publication/271218362_Enabling_scalable_stochastic_gradient-based_inference_for_Gaussian_processes_by_employing_the_Unbiased_LInear_System_SolvEr_ULISSE"],"refrenceUrls":["https://www.researchgate.net/publication/13258954_Noise_without_Noise_A_New_Monte_Carlo_Method","https://www.researchgate.net/publication/1993692_A_Noisy_Monte_Carlo_Algorithm","https://www.researchgate.net/publication/225081349_Coupled_MCMC_with_a_randomized_acceptance_probability","https://www.researchgate.net/publication/234087001_Approximate_Bayesian_computation_via_empirical_likelihood","https://www.researchgate.net/publication/232062873_Efficient_implementation_of_Markov_chain_Monte_Carlo_when_using_an_unbiased_likelihood_estimator","https://www.researchgate.net/publication/24168169_The_pseudo-marginal_approach_for_effcient_Monte_Carlo_computations","https://www.researchgate.net/publication/41518324_Bayesian_computation_for_statistical_models_with_intractable_normalizing_constants"],"citedInIDs":[264936676,273640222,271218362],"refrenceIDs":[13258954,1993692,225081349,234087001,232062873,24168169,41518324],"pageRank":5.314734299140724E-4}
