{"id":239744365,"name":"Hydrological response to an abrupt shift in surface air temperature over France in 1987/88","abstraction":"A sequence of observations undergoes sudden changes at unknown times. We model the process by supposing that there is an underlying sequence of parameters partitioned into contiguous blocks of equal parameter values; the beginning of each block is said to be a change point. Observations are then assumed to be independent in different blocks given the sequence of parameters. In a Bayesian analysis it is necessary to give probability distributions to both the change points and the parameters. We use product partition models (Barry and Hartigan 1992), which assume that the probability of any partition is proportional to a product of prior cohesions, one for each block in the partition, and that given the blocks the parameters in different blocks have independent prior distributions. Given the observations a new product partition model holds, with posterior cohesions for the blocks and new independent block posterior distributions for parameters. The product model thus provides a convenient machinery for allowing the data to weight the partitions likely to hold; inference about particular parameters may then be made by first conditioning on the partition, and then averaging over all partitions. The parameter values may be estimated exactly in O(n3) calculations, or to an adequate approximation by Markov sampling techniques that are O(n) in the number of observations. The Markov sampling computations are thus practicable for long sequences. We compare this model with a number of alternative approaches to fitting change points and parameters when the error distribution is normal, then show that the proposed method is superior to the alternatives in detecting sharp short-lived changes in the parameters.","authors":["Daniel Barry","JA Hartigan"],"citedInUrls":["https://www.researchgate.net/publication/283357214_Hydrological_response_to_an_abrupt_shift_in_surface_air_temperature_over_France_in_198788","https://www.researchgate.net/publication/280773144_An_Empirical_Bayesian_Analysis_of_Simultaneous_Changepoints_in_Multiple_Data_Sequences","https://www.researchgate.net/publication/277725624_Geographic_variation_in_the_ecological_effects_of_extinction_of_Australia%27s_Pleistocene_megafauna"],"refrenceUrls":["https://www.researchgate.net/publication/38359626_Product_Partition_Models_for_Change_Point_Problems","https://www.researchgate.net/publication/38365884_Estimating_the_Current_Mean_of_a_Normal_Distribution_Which_Is_Subject_to_Changes_in_Time","https://www.researchgate.net/publication/224377707_Markov_Random_Field_Texture_Models","https://www.researchgate.net/publication/30962637_Rank_Tests_for_Changepoint_Problems","https://www.researchgate.net/publication/200622065_Equation_of_State_Calculations_by_Fast_Computing_Machines","https://www.researchgate.net/publication/38359202_Estimation_of_a_Noisy_Discrete-Time_Step_Function_Bayes_and_Empirical_Bayes_Approaches"],"citedInIDs":[283357214,280773144,277725624],"refrenceIDs":[38359626,38365884,224377707,30962637,200622065,38359202],"pageRank":9.225956224315879E-4}
