{"id":240489008,"name":"Multivariate Spatial Covariance Models: A Conditional Approach","abstraction":"The covariance and variogram models (ordinary or generalized) are important statistical tools used in various estimation and simulation techniques which have been recently applied to diverse hydrologic problems. For example, the efficacy of kriging, a method for interpolating, filtering, or averaging spatial phenomena, depends, to a large extent, on the covariance or variogram model chosen. The aim of this article is to provide the users of these techniques with convenient criteria that may help them to judge whether a function which arises in a particular problem, and is not included among the known covariance or variogram models, is permissible as such a model. This is done by investigating the properties of the candidate model in both the space and frequency domains. In the present article this investigation covers stationary random functions as well as intrinsic random functions (i.e., nonstationary functions for which increments of some order are stationary). Then, based on the theoretical results obtained, a procedure is outlined and successfully applied to a number of candidate models. In order to give to this procedure a more practical context, we employ \"stereological\" equations that essentially transfer the investigations to one-dimensional space, together with approximations in terms of polygonal functions and Fourier-Bessel series expansions. There are many benefits and applications of such a procedure. Polygonal models can be fit arbitrarily closely to the data. Also, the approximation of a particular model in the frequency domain by a Fourier-Bessel series expansion can be very effective. This is shown by theory and by example.","authors":["George Christakos"],"citedInUrls":["https://www.researchgate.net/publication/274730196_Multivariate_Spatial_Covariance_Models_A_Conditional_Approach","https://www.researchgate.net/publication/261404651_Uncertainty_quantification_in_geostatistical_approach_to_inverse_problems","https://www.researchgate.net/publication/258724504_Efficient_methods_for_large-scale_linear_inversion_using_a_geostatistical_approach"],"refrenceUrls":["https://www.researchgate.net/publication/31321231_Sampling_Properties_of_Local_Statistics_in_Stationary_Stochastic_Series","https://www.researchgate.net/publication/239062652_The_Turning_Bands_Method_for_Simulation_of_Random_Fields_Using_Line_Generation_by_a_Spectral_Method","https://www.researchgate.net/publication/222746523_Kriging_in_Hydrosciences","https://www.researchgate.net/publication/248806866_Spatial_Variability_and_Uncertainty_in_Ground-water_Flow_Parameters_A_Geostatistical_Approach","https://www.researchgate.net/publication/230837892_The_Intrinsic_Random_Functions_and_Their_Applications","https://www.researchgate.net/publication/31398319_On_Stationary_Processes_in_the_Plane","https://www.researchgate.net/publication/243099090_Some_Classes_of_Random_Fields_in_nDimensional_Space_Related_to_Stationary_Random_Processes","https://www.researchgate.net/publication/288939892_Random_processes_with_stationary_increments_of_order_n"],"citedInIDs":[274730196,261404651,258724504],"refrenceIDs":[31321231,239062652,222746523,248806866,230837892,31398319,243099090,288939892],"pageRank":6.011053088108499E-4}
