{"id":259915130,"name":"A robust regression based on weighted LSSVM and penalized trimmed squares","abstraction":"In this paper, we deal with the data-driven selection of multidimensional and (possibly) anisotropic bandwidths in the general problem of kernel empirical risk minimization. We propose a universal selection rule, which leads to optimal adaptive results in a large variety of statistical models such as nonparametric regression or statistical learning with errors-in-variables. These results are stated in the context of smooth loss functions, where the gradient of the risk appears as a good criterion to measure the performance of our estimators. This turns out to be helpful to derive excess risk bounds - with fast rates of convergence - in noisy clustering as well as adaptive minimax results for pointwise and global estimation in robust nonparametric regression. The selection rule consists of a comparison of the gradient empirical risks. It can be viewed as a non-trivial improvement of the so-called GL method (see Goldenshluger and Lepski [16]) to non-linear estimators. Another main advantage of our selection rule is the non-dependency on the smallest eigenvalue of the Hessian matrix of the risk, which is a changing and unknown parameter determined by the underlying model. Keywords and phrases: Adaptivity, Bandwidth Selection, ERM, Errors-in-variables, Robust Regression, Statistical Learning","authors":[],"citedInUrls":[],"refrenceUrls":["https://www.researchgate.net/publication/237082691_Adaptive_Noisy_Clustering","https://www.researchgate.net/publication/3079600_The_minimax_distortion_redundancy_in_empirical_quantizer_design","https://www.researchgate.net/publication/243785736_Statistical_Estimation_Asymptotic_Theory","https://www.researchgate.net/publication/220660183_From_Local_Kernel_to_Nonlocal_Multiple-Model_Image_Denoising","https://www.researchgate.net/publication/226732385_Propagation-Separation_Approach_for_Local_Likelihood_Estimation","https://www.researchgate.net/publication/236621714_Anisotropic_oracle_inequalities_in_noisy_quantization","https://www.researchgate.net/publication/24269288_Uniform_bounds_for_norms_of_sums_of_independent_random_functions","https://www.researchgate.net/publication/38358651_Strong_Consistency_of_K-Means_Clustering","https://www.researchgate.net/publication/245759642_Concentration_Inequalities_and_Model_Selection","https://www.researchgate.net/publication/229158043_A_Robust_Fully_Adaptive_M-estimator_for_Pointwise_Estimation_in_Heteroscedastic_Regression"],"citedInIDs":[],"refrenceIDs":[237082691,3079600,243785736,220660183,226732385,236621714,24269288,38358651,245759642,229158043],"pageRank":5.314734299140724E-4}
