{"id":260232379,"name":"Bridging the Gap between Stochastic Gradient MCMC and Stochastic Optimization","abstraction":"Hamiltonian Monte Carlo (HMC) sampling methods provide a mechanism for defining distant proposals with high acceptance probabilities in a Metropolis-Hastings framework, enabling more efficient exploration of the state space than standard random-walk proposals. The popularity of such methods has grown significantly in recent years. However, a limitation of HMC methods is the required gradient computation for simulation of the Hamiltonian dynamical system---such a computation is infeasible in problems involving a large sample size or streaming data. Instead, we must rely on a noisy gradient estimate computed from a subset of the data. In this paper, we explore the properties of such a stochastic gradient HMC approach. Surprisingly, the natural implementation of the stochastic approximation can be arbitrarily bad. To address this problem we introduce a variant that uses second-order Langevin dynamics with a friction term that counteracts the effects of the noisy gradient, maintaining the desired target distribution as the invariant distribution. Results on simulated data validate our theory. We also provide an application of our methods to a classification task using neural networks and to online Bayesian matrix factorization.","authors":["Tianqi Chen","Emily B. Fox","Carlos Guestrin"],"citedInUrls":["https://www.researchgate.net/publication/288713780_Bridging_the_Gap_between_Stochastic_Gradient_MCMC_and_Stochastic_Optimization","https://www.researchgate.net/publication/288059869_Preconditioned_Stochastic_Gradient_Langevin_Dynamics_for_Deep_Neural_Networks","https://www.researchgate.net/publication/288059688_High-Order_Stochastic_Gradient_Thermostats_for_Bayesian_Learning_of_Deep_Models"],"refrenceUrls":["https://www.researchgate.net/publication/231108858_Existence_and_construction_of_dynamical_potential_in_nonequilibrium_processes_without_detailed_balance","https://www.researchgate.net/publication/51953669_Relation_of_a_New_Interpretation_of_Stochastic_Differential_Equations_toIto_Process","https://www.researchgate.net/publication/29522811_A_generalized_guided_Monte_Carlo_algorithm","https://www.researchgate.net/publication/221619083_Bayesian_Learning_via_Stochastic_Dynamics"],"citedInIDs":[288713780,288059869,288059688],"refrenceIDs":[231108858,51953669,29522811,221619083],"pageRank":7.903937801813575E-4}
