{"id":261289213,"name":"Probabilistic Programming with Gaussian Process Memoization","abstraction":"We describe Venture, an interactive virtual machine for probabilistic programming that aims to be sufficiently expressive, extensible, and efficient for general-purpose use. Like Church, probabilistic models and inference problems in Venture are specified via a Turing-complete, higher-order probabilistic language descended from Lisp. Unlike Church, Venture also provides a compositional language for custom inference strategies built out of scalable exact and approximate techniques. We also describe four key aspects of Venture\u0027s implementation that build on ideas from probabilistic graphical models. First, we describe the stochastic procedure interface (SPI) that specifies and encapsulates primitive random variables. The SPI supports custom control flow, higher-order probabilistic procedures, partially exchangeable sequences and ``likelihood-free\u0027\u0027 stochastic simulators. It also supports external models that do inference over latent variables hidden from Venture. Second, we describe probabilistic execution traces (PETs), which represent execution histories of Venture programs. PETs capture conditional dependencies, existential dependencies and exchangeable coupling. Third, we describe partitions of execution histories called scaffolds that factor global inference problems into coherent sub-problems. Finally, we describe a family of stochastic regeneration algorithms for efficiently modifying PET fragments contained within scaffolds. Stochastic regeneration linear runtime scaling in cases where many previous approaches scaled quadratically. We show how to use stochastic regeneration and the SPI to implement general-purpose inference strategies such as Metropolis-Hastings, Gibbs sampling, and blocked proposals based on particle Markov chain Monte Carlo and mean-field variational inference techniques.","authors":["Daniel Selsam","Yura Perov"],"citedInUrls":["https://www.researchgate.net/publication/287249271_Probabilistic_Programming_with_Gaussian_Process_Memoization","https://www.researchgate.net/publication/281671077_C3_Lightweight_Incrementalized_MCMC_for_Probabilistic_Programs_using_Continuations_and_Callsite_Caching","https://www.researchgate.net/publication/280104192_Black-Box_Policy_Search_with_Probabilistic_Programs"],"refrenceUrls":["https://www.researchgate.net/publication/235656799_Structure_Discovery_in_Nonparametric_Regression_through_Compositional_Kernel_Search","https://www.researchgate.net/publication/232275984_Exploiting_Compositionality_to_Explore_a_Large_Space_of_Model_Structures","https://www.researchgate.net/publication/221706251_Gibbs_Sampling_in_Open-Universe_Stochastic_Languages"],"citedInIDs":[287249271,281671077,280104192],"refrenceIDs":[235656799,232275984,221706251],"pageRank":6.023786362425671E-4}
