{"id":265293288,"name":"A Null Model for Pearson Coexpression Networks","abstraction":"A fundamental goal of systems biology is to create models that describe relationships between biological components. Networks are an increasingly popular approach to this problem. However, a scientist interested in modeling biological (e.g., gene expression) data as a network is quickly confounded by the fundamental problem: how to construct the network? It is fairly easy to construct a network, but is it the network for the problem being considered? This is an important problem with three fundamental issues: How to weight edges in the network in order to capture actual biological interactions? What is the effect of the type of biological experiment used to collect the data from which the network is constructed? How to prune the weighted edges (or what cut-off to apply)? Differences in the construction of networks could lead to different biological interpretations. Indeed, we find that there are statistically significant dissimilarities in the functional content and topology between gene co-expression networks constructed using different edge weighting methods, data types, and edge cut-offs. We show that different types of known interactions, such as those found through Affinity Capture-Luminescence or Synthetic Lethality experiments, appear in significantly varying amounts in networks constructed in different ways. Hence, we demonstrate that different biological questions may be answered by the different networks. Consequently, we posit that the approach taken to build a network can be matched to biological questions to get targeted answers. More study is required to understand the implications of different network inference approaches and to draw reliable conclusions from networks used in the field of systems biology.","authors":["Tijana Milenković"],"citedInUrls":["https://www.researchgate.net/publication/259048235_A_Null_Model_for_Pearson_Coexpression_Networks"],"refrenceUrls":["https://www.researchgate.net/publication/8910145_Network_Biology_Understanding_The_Cell%27s_Functional_Organization","https://www.researchgate.net/publication/13443714_Eisen_MB_Spellman_PT_Brown_PO_Botstein_D_Cluster_analysis_and_display_of_genome-wide_expression_patterns_Proc_Natl_Acad_Sci_USA_95_14863-14868","https://www.researchgate.net/publication/49684725_Coexpression_Network_Analysis_Identifies_Transcriptional_Modules_Related_to_Proastrocytic_Differentiation_and_Sprouty_Signaling_in_Glioma","https://www.researchgate.net/publication/7641976_Feature_Selection_Based_On_Mutual_Information_Criteria_of_Max-DependencyMax-Relevance_and_Min-Redundancy","https://www.researchgate.net/publication/10924750_Expression_profiling_predicts_outcome_in_breast_cancer","https://www.researchgate.net/publication/37811096_The_yeast_coexpression_network_has_a_small-world_scale-free_architecture_and_can_be_explained_by_a_simple_model","https://www.researchgate.net/publication/24061828_The_Centrality_Index_of_a_Graph","https://www.researchgate.net/publication/26864050_Coexpression_network_based_on_natural_variation_in_human_gene_expression_reveals_gene_interactions_and_functions","https://www.researchgate.net/publication/220639605_Computing_Communities_in_Large_Networks_Using_Random_Walks","https://www.researchgate.net/publication/11869653_Inferring_Subnetworks_from_Perturbed_Expression_Profiles"],"citedInIDs":[259048235],"refrenceIDs":[8910145,13443714,49684725,7641976,10924750,37811096,24061828,26864050,220639605,11869653],"pageRank":5.314734299140724E-4}
