{"id":270162139,"name":"Bayesian Nonparameteric Multiresolution Estimation for the American Community Survey","abstraction":"Models are employed to improve the efficiency of time-indexed survey direct estimates collected for a set of domains (e.g. states or counties) by borrowing estimation in-formation across time. Typically employed models assume the survey estimates are independent over the states, however, which will be often violated where there are similarities in their underlying data generating processes. We propose a Bayesian nonparametric formulation that allows the data to estimate a general dependence structure, both in time and among the states, by treating each state-indexed time series as a noisy function. We construct and compare Gaussian process and Gaussian Markov random field prior specifications for the functions under a Dirichlet process (DP) mixture over parameters of their covariance or precision matrices of the Gaus-sian distributions that generate the functions to model the dependence among them. Our formulations more flexibly estimate a dependence structure among the state functions than approaches that directly cluster the functions because, under our DP mixture of functions, those functions assigned to the same cluster are drawn from a distribution with the same covariance parameters, but don\u0027t have to be identi-cal. We compare the performances of our two alternatives on synthetic data and apply the mixture formulation for the estimation of by-state employment totals from 2000 − 2013 obtained from the Current Population Survey.","authors":[],"citedInUrls":["https://www.researchgate.net/publication/270162013_Bayesian_Nonparameteric_Multiresolution_Estimation_for_the_American_Community_Survey"],"refrenceUrls":["https://www.researchgate.net/publication/229100417_A_Constructive_Definition_of_the_Dirichlet_Prior","https://www.researchgate.net/publication/38357646_Ferguson_Distributions_Via_Polya_Urn_Schemes","https://www.researchgate.net/publication/228562511_Nonparametric_Bayesian_models_through_probit_stick-breaking_processes","https://www.researchgate.net/publication/254287644_Generalized_Linear_Models_for_Small-Area_Estimation","https://www.researchgate.net/publication/4914296_Controlling_the_reinforcement_in_Bayesian_non-parametric_mixture_models","https://www.researchgate.net/publication/229100346_Markov_Chain_Sampling_Methods_for_Dirichlet_Process_Mixture_Models","https://www.researchgate.net/publication/2741222_Bayesian_Density_Estimation_and_Inference_Using_Mixtures","https://www.researchgate.net/publication/2826951_The_Two_Parameter_Poisson-Dirichlet_Distribution_Derived_From_a_Stable_Subordinator"],"citedInIDs":[270162013],"refrenceIDs":[229100417,38357646,228562511,254287644,4914296,229100346,2741222,2826951],"pageRank":5.314734299140724E-4}
