{"id":271554241,"name":"Impact of Clustering on the Performance of Network De-anonymization","abstraction":"Approximate graph matching (AGM) refers to the problem of mapping the vertices of two structurally similar graphs, which has applications in social networks, computer vision, chemistry, and biology. Given its computational cost, AGM has mostly been limited to either small graphs (e.g., tens or hundreds of nodes), or to large graphs in combination with side information beyond the graph structure (e.g., a seed set of pre-mapped node pairs). In this paper, we cast AGM in a Bayesian framework based on a clean definition of the probability of correctly mapping two nodes, which leads to a polynomial time algorithm that does not require side information. Node features such as degree and distances to other nodes are used as fingerprints. The algorithm proceeds in rounds, such that the most likely pairs are mapped first; these pairs subsequently generate additional features in the fingerprints of other nodes. We evaluate our method over real social networks and show that it achieves a very low matching error provided the two graphs are sufficiently similar. We also evaluate our method on random graph models to characterize its behavior under various levels of node clustering.","authors":["Pedram Pedarsani","Daniel R. Figueiredo","Matthias Grossglauser"],"citedInUrls":["https://www.researchgate.net/publication/280912238_Impact_of_Clustering_on_the_Performance_of_Network_De-anonymization","https://www.researchgate.net/publication/282462945_Growing_a_Graph_Matching_from_a_Handful_of_Seeds","https://www.researchgate.net/publication/274227662_Using_Identity_Separation_Against_De-anonymization_of_Social_Networks"],"refrenceUrls":["https://www.researchgate.net/publication/220473536_Resisting_Structural_Re-identification_in_Anonymized_Social_Networks","https://www.researchgate.net/publication/3193917_Exact_and_Approximate_Graph_Matching_Using_Random_Walks","https://www.researchgate.net/publication/220538369_SAPPER_Subgraph_Indexing_and_Approximate_Matching_in_Large_Graphs","https://www.researchgate.net/publication/3193116_Bayesian_Graph_Edit_Distance"],"citedInIDs":[280912238,282462945,274227662],"refrenceIDs":[220473536,3193917,220538369,3193116],"pageRank":6.023786362425671E-4}
