{"id":272423116,"name":"Large Population Games in Radial Loss Networks: Computationally Tractable Equilibria for Distributed Network Admission Control","abstraction":"In the classical non-adaptive group testing setup, pools of items are tested together, and the main goal of a recovery algorithm is to identify the \"complete defective set\" given the outcomes of different group tests. In contrast, the main goal of a \"non-defective subset recovery\" algorithm is to identify a \"subset\" of non-defective items given the test outcomes. In this paper, we present a bouquet of computationally efficient and analytically tractable non-defective subset recovery algorithms. By analyzing the probability of error of the algorithms, we obtain bounds on the number of tests required for non-defective subset recovery with arbitrarily small probability of error. Our analysis accounts for the impact of both the additive noise (false positives) and dilution noise (false negatives). By comparing with the information theoretic lower bounds, we show that the upper bounds on the number of tests are order-wise tight up to a $\\log(K)$ factor, where $K$ is the number of defective items. We also provide simulation results that compare the relative performance of the different algorithms and provide further insights into their practical utility. The proposed algorithms significantly outperform the straightforward approaches of testing items one-by-one, and of first identifying the defective set and then choosing the non-defective items from the complement set, in terms of the number of measurements required to ensure a given success rate.","authors":["Abhay Sharma"],"citedInUrls":[],"refrenceUrls":["https://www.researchgate.net/publication/38368084_The_Detection_of_Defective_Members_of_Large_Population","https://www.researchgate.net/publication/215601311_Introductory_Lectures_on_Convex_Optimization_A_Basic_Course_Applied_Optimization","https://www.researchgate.net/publication/261091313_Boolean_compressed_sensing_LP_relaxation_for_group_testing","https://www.researchgate.net/publication/221669789_Probability_and_Computing_Randomized_Algorithms_and_Probabilistic_Analysis","https://www.researchgate.net/publication/242959929_The_separating_property_of_random_matrices","https://www.researchgate.net/publication/224174399_Information_Theoretic_Bounds_for_Compressed_Sensing","https://www.researchgate.net/publication/244506454_On_Concentration-of-Measure_Inequalities"],"citedInIDs":[],"refrenceIDs":[38368084,215601311,261091313,221669789,242959929,224174399,244506454],"pageRank":5.314734299140724E-4}
