{"id":272431489,"name":"Visual Tracking Algorithm Based on Probabilistic Graphical Model","abstraction":"This article proposes a generative probabilistic graphical model with hidden states (Neural Gas Graphical Model (NGGM)) based on data approximation with a grid of \"neural gas\" nodes aimed at solving the problem of long time series classification. Such time series include information about changes in economic, weather and health values, as well as information about changes in values of operation sensors of technical objects during a quite long period. The most difficult task of classification of such long time series using probabilistic graphical models with hidden states is the selection of the optimum number of hidden states. This work proposes a method for automatic selection of the optimum number of hidden states of the model in the course of the model learning. The model proposed in the article and the methods of its learning are based on a combination of elements used in the metric and Bayesian approaches to classification. The basic NGGM purpose is to match hidden states of a graphical model and nodes (neurons) of the approximating grid. Comparative assessment of the quality of the proposed NGGM model classification with the currently most common time series classification models has been made: the HMM (Hidden Markov Model) and the HCRF (Hidden Conditional Random Fields) applied at the data sets from the UCI repository. The quality was assessed by the macro-average F-measure criterion using the k-fold cross-validation. As a result of classification quality analysis, it was noted that the proposed NGGM model showed better classification quality on the data set being a set of multiple, labeled samples of pen tip trajectories recorded whilst writing individual characters than the HCRF and HMM models.","authors":["Irina N. Palamar","Sergey S. Yulin"],"citedInUrls":[],"refrenceUrls":["https://www.researchgate.net/publication/224881743_The_Infinite_Hidden_Markov_Model","https://www.researchgate.net/publication/221344856_Recognition_and_Reproduction_of_Gestures_using_a_Probabilistic_Framework_combining_PCA_ICA_and_HMM","https://www.researchgate.net/publication/23545343_Selecting_Hidden_Markov_Model_State_Number_with_Cross-Validated_Likelihood","https://www.researchgate.net/publication/227716500_Factorized_Asymptotic_Bayesian_Hidden_Markov_Models","https://www.researchgate.net/publication/281329064_Principal_Manifolds_for_Data_Visualization_and_Dimension_Reduction","https://www.researchgate.net/publication/220690050_Probabilistic_Graphical_Models_Principles_and_Techniques","https://www.researchgate.net/publication/2675467_Using_Self-Organizing_Maps_and_Learning_Vector_Quantization_for_Mixture_Density_Hidden_Markov_Models","https://www.researchgate.net/publication/215386319_A_Neural-Gas_Network_Learns_Topologies","https://www.researchgate.net/publication/3333750_A_continuous_density_interpretation_of_discrete_HMM_systems_and_MMI-neural_networks","https://www.researchgate.net/publication/224736186_Joint_quantizer_design_and_parameter_estimation_for_discrete_hidden_Markov_models"],"citedInIDs":[],"refrenceIDs":[224881743,221344856,23545343,227716500,281329064,220690050,2675467,215386319,3333750,224736186],"pageRank":5.314734299140724E-4}
