{"id":273706611,"name":"Urban Air Pollution Monitoring System with Forecasting Models","abstraction":"Satellite-retrieved aerosol optical depth (AOD) can potentially provide an effective way to complement the spatial coverage limitation of a ground particulate air-pollution monitoring network such as the U.S. Environment Protection Agency\u0027s regulatory monitoring network. One of the current state-of-the-art AOD retrieval methods is the National Aeronautics and Space Administration\u0027s Multiangle Imaging SpectroRadiometer (MISR) operational algorithm, which has a spatial resolution of 17.6 km $times$ 17.6 km. Although the MISR\u0027s aerosol products lead to exciting research opportunities to study particle composition at a regional scale, its spatial resolution is too coarse for analyzing urban areas, where the air pollution has stronger spatial variations and can severely impact public health and the environment. Accordingly, a novel AOD retrieval algorithm with a resolution of 4.4 km $times$ 4.4 km has been recently developed, which is based on hierarchical Bayesian modeling and the Monte Carlo Markov chain (MCMC) inference method. In this paper, we carry out detailed quantitative and qualitative evaluations of the new algorithm, which is called the HB-MCMC algorithm, using recent AErosol RObotic NETwork (AERONET) Distributed Regional Aerosol Gridded Observation Networks (DRAGON) campaign data obtained in the summer of 2011. These data, which were not available in a previous study, contain spatially dense ground measurements of the AOD and other aerosol particle characteristics from the Baltimore–Washington, DC region. Our results show that the HB-MCMC algorithm has 16.2% more AOD retrieval coverage and improves the root-mean-square error by 38.3% compared with the MISR operational algorithm. Our detailed analyses with various metrics show that the improvement of our scheme is coming from the novel mo- eling and inference method. Furthermore, the map overlay of the retrieval results qualitatively confirms the findings of the quantitative analyses.","authors":["Yueqing Wang"],"citedInUrls":[],"refrenceUrls":["https://www.researchgate.net/publication/228372291_Multiangle_Imaging_Spectroradiometer_MISR_global_aerosol_optical_depth_validation_based_on_2_years_of_coincident_Aerosol_Robotic_Network_AERONET_observations_J_Geophys_Res_110_D10S04","https://www.researchgate.net/publication/7814619_Estimating_Ground-Level_PM_25_in_the_Eastern_United_States_Using_Satellite_Remote_Sensing","https://www.researchgate.net/publication/253993036_Level_2_Ancillarv_Products_and_Datasets_Algorithm_The6retical_Basis","https://www.researchgate.net/publication/4700270_A_Modified_Linear-Mixing_Method_for_Calculating_Atmospheric_Path_Radiances_of_Aerosol_Mixtures","https://www.researchgate.net/publication/252592849_Validation_of_Multiangle_Imaging_Spectroradiometer_MISR_aerosol_optical_thickness_measurements_using_Aerosol_Robotic_Network_AERONET_observations_over_the_contiguous_United_States_J_Geophys_Res_109D06","https://www.researchgate.net/publication/51899253_An_empirical_relationship_between_PM25_and_aerosol_optical_depth_in_Delhi_Metropolitan","https://www.researchgate.net/publication/228990427_Comparison_of_MISR_aerosol_optical_thickness_with_AERONET_measurements_in_Beijing_metropolitan_area","https://www.researchgate.net/publication/38363224_Inference_From_Iterative_Simulation_Using_Multiple_Sequences","https://www.researchgate.net/publication/51917396_A_Hierarchical_Bayesian_Approach_for_Aerosol_Retrieval_Using_MISR_Data","https://www.researchgate.net/publication/225089726_2006_Critical_Review_--_Health_Effects_of_Fine_Particulate_Air_Pollution_Lines_that_Connect"],"citedInIDs":[],"refrenceIDs":[228372291,7814619,253993036,4700270,252592849,51899253,228990427,38363224,51917396,225089726],"pageRank":5.314734299140724E-4}
