{"id":274140346,"name":"Understanding students\u0027 use of online learning tools through online learning readiness assessment","abstraction":"Mobile crowdsensing has been intensively explored recently due to its flexible and pervasive sensing ability. Although many crowdsensing platforms have been built for various applications, the general issue of how to manage such systems intelligently remains largely open. While recent investigations mostly focus on incentivizing crowdsensing, the robustness of crowdsensing toward uncontrollable sensing quality, another important issue, has been widely neglected. Due to the nonprofessional personnel and devices, the quality of crowdsensing data cannot be fully guaranteed, hence the revenue gained from mobile crowdsensing is generally uncertain. Moreover, the need for compensating the sensing costs under a limited budget has exacerbated the situation: one does not enjoy an infinite horizon to learn the sensing ability of the crowd and hence to make decisions based on sufficient statistics. In this paper, we present a novel framework, Budget LImited robuSt crowdSensing (BLISS), to handle this problem through an online learning approach. Our approach aims to minimize the difference on average sense (a.k.a. regret) between the achieved total sensing revenue and the (unknown) optimal one, and we show that our BLISS sensing policies achieve logarithmic regret bounds and Hannan consistency. Finally, we use extensive simulations to demonstrate the effectiveness of BLISS.","authors":[],"citedInUrls":[],"refrenceUrls":["https://www.researchgate.net/publication/220144587_Mobile_Crowdsensing_Current_State_and_Future_Challenges","https://www.researchgate.net/publication/260670866_Mobile_Phone_Sensing_Systems_A_Survey","https://www.researchgate.net/publication/254464487_Crowdsourcing_to_smartphones_incentive_mechanism_design_for_mobile_phone_sensing","https://www.researchgate.net/publication/261060371_Optimal_Incentive-driven_Design_of_Participatory_Sensing_Systems","https://www.researchgate.net/publication/271454819_Providing_Privacy-Aware_Incentives_in_Mobile_Sensing_Systems","https://www.researchgate.net/publication/255994642_Truthful_Scheduling_Mechanisms_for_Powering_Mobile_Crowdsensing","https://www.researchgate.net/publication/254006277_On_truth_discovery_in_social_sensing_A_maximum_likelihood_estimation_approach","https://www.researchgate.net/publication/258398633_A_Hybrid_Approach_for_Improving_the_Data_Quality_of_Mobile_Phone_Sensing","https://www.researchgate.net/publication/269298351_Toward_optimal_allocation_of_location_dependent_tasks_in_crowdsensing","https://www.researchgate.net/publication/221091760_A_framework_for_data_quality_and_feedback_in_participatory_sensing"],"citedInIDs":[],"refrenceIDs":[220144587,260670866,254464487,261060371,271454819,255994642,254006277,258398633,269298351,221091760],"pageRank":5.314734299140724E-4}
