{"id":274402946,"name":"Lack of Critical Slowing Down Suggests that Financial Meltdowns Are Not Critical Transitions, yet Rising Variability Could Signal Systemic Risk","abstraction":"The mesoscopic organization of complex systems, from financial markets to the brain, is an intermediate between the microscopic dynamics of individual units (stocks or neurons, in the mentioned cases), and the macroscopic dynamics of the system as a whole. The organization is determined by \"communities\" of units whose dynamics, represented by time series of activity, is more strongly correlated internally than with the rest of the system. Recent studies have shown that the binary projections of various financial and neural time series exhibit nontrivial dynamical features that resemble those of the original data. This implies that a significant piece of information is encoded into the binary projection (i.e. the sign) of such increments. Here, we explore whether the binary signatures of multiple time series can replicate the same complex community organization of the financial market, as the original weighted time series. We adopt a method that has been specifically designed to detect communities from cross-correlation matrices of time series data. Our analysis shows that the simpler binary representation leads to a community structure that is almost identical with that obtained using the full weighted representation. These results confirm that binary projections of financial time series contain significant structural information.","authors":["Assaf Almog","Ferry Besamusca","Diego Garlaschelli"],"citedInUrls":[],"refrenceUrls":["https://www.researchgate.net/publication/227390187_Theory_of_Financial_Risk_and_Derivative_Pricing","https://www.researchgate.net/publication/235361270_An_Introduction_to_Econophysics_Correlations_and_Complexity_in_Finance","https://www.researchgate.net/publication/46462363_Hierarchical_Structure_in_Financial_Markets","https://www.researchgate.net/publication/45854744_Community_Detection_in_Graphs","https://www.researchgate.net/publication/264920260_Networks_An_Introduction","https://www.researchgate.net/publication/258345779_Community_Detection_for_Correlation_Matrices","https://www.researchgate.net/publication/46462216_The_non-random_walk_of_stock_prices_The_long-term_correlation_between_signs_and_sizes","https://www.researchgate.net/publication/46423030_Quantitative_law_describing_market_dynamics_before_and_after_interest-rate_change","https://www.researchgate.net/publication/7670391_Generalized_percolation_in_random_directed_networks","https://www.researchgate.net/publication/261988858_Binary_versus_non-binary_information_in_real_time_series_Empirical_results_and_maximum-entropy_matrix_models"],"citedInIDs":[],"refrenceIDs":[227390187,235361270,46462363,45854744,264920260,258345779,46462216,46423030,7670391,261988858],"pageRank":5.314734299140724E-4}
