{"id":275032644,"name":"A Large-Scale Web QoS Prediction Scheme for Industrial Internet of Things Based on Kernel Machine Learning Algorithm","abstraction":"Internet of Things (IoT) systems process and respond to multiple (external) events, while performing computations for a Sense-Compute-Control (SCC) or a Sense-Only (SO) goal. Given the limitations of the interconnected resource-constrained devices, the execution environment can be based on an appropriate operating system for the IoT. The development effort can be reduced, when applications are built on top of RESTful web services, which can be shared and reused. However, the asynchronous communication between remote nodes is prone to event scheduling delays, which cannot be predicted and taken into account while programming the application. Long delays in message processing and communication, due to packet collisions, are avoided by carefully choosing the data transmission frequencies between the system\u0027s nodes. But even when specialized simulators are available, it is still a hard challenge to guarantee the functional and non-functional requirements at the application and system levels. In this article, we introduce a model-based rigorous analysis approach using the BIP component framework. We present a BIP model for IoT applications running on the Contiki OS. At the application level, we verify qualitative properties for service responsiveness requirements, whereas at the system level we can validate qualitative and quantitative properties using statistical model checking. We present results for an application scenario running on a distributed system infrastructure","authors":["Marius Bozga"],"citedInUrls":[],"refrenceUrls":["https://www.researchgate.net/publication/228622373_Towards_a_zero-configuration_wireless_sensor_network_architecture_for_smart_buildings","https://www.researchgate.net/publication/221551132_Approximate_Probabilistic_Model_Checking","https://www.researchgate.net/publication/228095891_Internet_of_Things_IoT_A_Vision_Architectural_Elements_and_FutureDirections","https://www.researchgate.net/publication/220955545_COOJAMSPSim_interoperability_testing_for_wireless_sensor_networks","https://www.researchgate.net/publication/233794234_DiaSuite_a_Tool_Suite_To_Develop_SenseComputeControl_Applications","https://www.researchgate.net/publication/270588000_Building_Distributed_Sensor_Network_Applications_using_BIP","https://www.researchgate.net/publication/220762755_Statistical_Model_Checking_An_Overview","https://www.researchgate.net/publication/221081380_Contiki_-_A_Lightweight_and_Flexible_Operating_System_for_Tiny_Networked_Sensors","https://www.researchgate.net/publication/42427837_Lecture_Notes_in_Computer_Science","https://www.researchgate.net/publication/220030744_Using_state_machines_for_a_model_driven_development_of_web_service-based_sensor_network_applications"],"citedInIDs":[],"refrenceIDs":[228622373,221551132,228095891,220955545,233794234,270588000,220762755,221081380,42427837,220030744],"pageRank":5.314734299140724E-4}
