{"id":279968247,"name":"A PAC Approach to Application-Specific Algorithm Selection","abstraction":"The pursuit of fast rates in online and statistical learning has led to the conception of many conditions in learning theory under which fast learning is possible. We show that most of these conditions are special cases of a single, unifying condition, that comes in two forms: the central condition for \u0027proper\u0027 learning algorithms that always output a hypothesis in the given model, and stochastic mixability for online algorithms that may make predictions outside of the model. We show that, under surprisingly weak conditions, both conditions are, in a certain sense, equivalent. The central condition has a re-interpretation in terms of convexity of a set of pseudoprobabilities, linking it to density estimation under misspecification. For bounded losses, we show how the central condition enables a direct proof of fast rates and we prove its equivalence to the Bernstein condition, itself a generalization of the Tsybakov-Mammen margin condition, which has played a central role in obtaining fast rates in statistical learning. Yet, while the Bernstein condition is two-sided, the central condition is one-sided, making it more suitable to deal with unbounded losses. In its stochastic mixability form, our condition generalizes both a stochastic exp-concavity condition identified by Juditsky, Rigollet and Tsybakov, and Vovk\u0027s notion of mixability. Our unifying conditions thus provide a significant step towards a characterization of fast rates in statistical learning, similar to how classical mixability characterizes constant regret in the sequential prediction with expert advice setting.","authors":["Tim van Erven","Nishant A. Mehta","Mark D. Reid","Robert C. Williamson"],"citedInUrls":[],"refrenceUrls":["https://www.researchgate.net/publication/41218833_Margin-adaptive_model_selection_in_Statistical_Learning","https://www.researchgate.net/publication/221619022_Progressive_mixture_rules_are_deviation_suboptimal","https://www.researchgate.net/publication/49940388_Convexity_classification_and_risk_bounds","https://www.researchgate.net/publication/220690817_Prediction_Learning_and_Games","https://www.researchgate.net/publication/3085138_On_the_Generalization_Ability_of_On-Line_Learning_Algorithms","https://www.researchgate.net/publication/267441193_Bayesian_asymptotics_with_misspecified_models","https://www.researchgate.net/publication/234028669_Follow_the_Leader_If_You_Can_Hedge_If_You_Must","https://www.researchgate.net/publication/1758781_Convergence_rates_of_posterior_distributions_for_noniid_observations","https://www.researchgate.net/publication/254819438_That_Simple_Device_Already_Used_by_Gauss","https://www.researchgate.net/publication/269417866_Inconsistency_of_Bayesian_Inference_for_Misspecified_Linear_Models_and_a_Proposal_for_Repairing_It"],"citedInIDs":[],"refrenceIDs":[41218833,221619022,49940388,220690817,3085138,267441193,234028669,1758781,254819438,269417866],"pageRank":5.314734299140724E-4}
