{"id":280773824,"name":"Local True Discovery Rate Weighted Polygenic Scores Using GWAS Summary Data","abstraction":"This work relates the framework of model-based clustering for spatial functional data where the data are surfaces. We first introduce a Bayesian spatial spline regression model with mixed-effects (BSSR) for modeling spatial function data. The BSSR model is based on Nodal basis functions for spatial regression and accommodates both common mean behavior for the data through a fixed-effects part, and variability inter-individuals thanks to a random-effects part. Then, in order to model populations of spatial functional data issued from heterogeneous groups, we integrate the BSSR model into a mixture framework. The resulting model is a Bayesian mixture of spatial spline regressions with mixed-effects (BMSSR) used for density estimation and model-based surface clustering. The models, through their Bayesian formulation, allow to integrate possible prior knowledge on the data structure and constitute a good alternative to recent mixture of spatial spline regressions model estimated in a maximum likelihood framework via the expectation-maximization (EM) algorithm. The Bayesian model inference is performed by Markov Chain Monte Carlo (MCMC) sampling. We derive two Gibbs sampler to infer the BSSR and the BMSSR models and apply them on simulated surfaces and a real problem of handwritten digit recognition using the MNIST data set. The obtained results highlight the potential benefit of the proposed Bayesian approaches for modeling surfaces possibly dispersed in particular in clusters.","authors":[],"citedInUrls":[],"refrenceUrls":["https://www.researchgate.net/publication/221995881_Bayesian_Data_Analysis_London","https://www.researchgate.net/publication/220490624_Model-based_Clustering_of_Time_Series_in_Group-specific_Functional_Subspaces","https://www.researchgate.net/publication/2763514_Computational_and_Inferential_Difficulties_With_Mixture_Posterior_Distributions","https://www.researchgate.net/publication/228629648_Mixture_of_Linear_Mixed_Models_for_Clustering_Gene_Expression_Profiles_from_Repeated_Microarray_Experiments","https://www.researchgate.net/publication/254440300_Componentwise_classification_and_clustering_of_functional_data","https://www.researchgate.net/publication/243763126_Estimation_of_Finite_Mixture_Distributions_Through_Bayesian_Sampling","https://www.researchgate.net/publication/2741222_Bayesian_Density_Estimation_and_Inference_Using_Mixtures","https://www.researchgate.net/publication/266239438_Finite_Mixture_and_Markov_Switching_Models","https://www.researchgate.net/publication/216300654_Probabilistic_Curve-Aligned_Clustering_and_Prediction_with_Mixture_Models","https://www.researchgate.net/publication/225734295_The_Elements_of_Statistical_Learning_Second_Edition_Data_Mining_Inference_and_Prediction"],"citedInIDs":[],"refrenceIDs":[221995881,220490624,2763514,228629648,254440300,243763126,2741222,266239438,216300654,225734295],"pageRank":5.314734299140724E-4}
