{"id":280873163,"name":"Parallel strategic oscillation: an application to the maximum leaf spanning tree problem","abstraction":"Many real-world problems involve massive amounts of data. Under these circumstances learning algorithms often become prohibitively expensive, making scalability a pressing issue to be addressed. A common approach is to perform sampling to reduce the size of the dataset and enable efficient learning. Alternatively, one customizes learning algorithms to achieve scalability. In either case, the key challenge is to obtain algorithmic efficiency without compromising the quality of the results. In this paper we discuss a meta-learning algorithm (PSBML) which combines features of parallel algorithms with concepts from ensemble and boosting methodologies to achieve the desired scalability property. We present both theoretical and empirical analyses which show that PSBML preserves a critical property of boosting, specifically, convergence to a distribution centered around the margin. We then present additional empirical analyses showing that this meta-level algorithm provides a general and effective framework that can be used in combination with a variety of learning classifiers. We perform extensive experiments to investigate the tradeoff achieved between scalability and accuracy, and robustness to noise, on both synthetic and real-world data. These empirical results corroborate our theoretical analysis, and demonstrate the potential of PSBML in achieving scalability without sacrificing accuracy.","authors":[],"citedInUrls":[],"refrenceUrls":["https://www.researchgate.net/publication/220321015_Core_Vector_Machines_Fast_SVM_Training_on_Very_Large_Data_Sets","https://www.researchgate.net/publication/235677367_A_Spatial_EA_Framework_for_Parallelizing_Machine_Learning_Methods","https://www.researchgate.net/publication/262348479_An_analysis_of_a_spatial_EA_parallel_boosting_algorithm","https://www.researchgate.net/publication/2763972_An_Analysis_of_the_Effects_of_Neighborhood_Size_and_Shape_on_Local_Selection_Algorithms","https://www.researchgate.net/publication/3418844_Selection_Intensity_in_Cellular_Evolutionary_Algorithms_for_Regular_Lattices","https://www.researchgate.net/publication/2570628_Exploiting_Unlabeled_Data_in_Ensemble_Methods","https://www.researchgate.net/publication/2458795_Improved_Boosting_Using_Confidence-rated_Predictions","https://www.researchgate.net/publication/244498683_Experiment_With_a_New_Boosting_Algorithm","https://www.researchgate.net/publication/2455627_Boosting_the_Margin_A_New_Explanation_for_the_Effectiveness_of_Voting_Methods","https://www.researchgate.net/publication/226612208_A_Feature_Selection_Newton_Method_for_Support_Vector_Machine_Classification"],"citedInIDs":[],"refrenceIDs":[220321015,235677367,262348479,2763972,3418844,2570628,2458795,244498683,2455627,226612208],"pageRank":5.314734299140724E-4}
