{"id":281217572,"name":"Fuzzy Approach for Three Level Linear Programming Problems","abstraction":"In this paper, we propose a new ensemble clustering approach termed ensemble clustering using factor graph (ECFG). Compared to the existing approaches, our approach has three main advantages: (1) the cluster number is obtained automatically and need not to be specified in advance; (2) the reliability of each base clustering can be estimated in an unsupervised manner and exploited in the consensus process; (3) our approach is efficient for processing ensembles with large data sizes and large ensemble sizes. In this paper, we introduce the concept of super-object, which serves as a compact and adaptive representation for the ensemble data and significantly facilitates the computation. Through the probabilistic formulation, we cast the ensemble clustering problem into a binary linear programming (BLP) problem. The BLP problem is NP-hard. To solve this optimization problem, we propose an efficient solver based on factor graph. The constrained objective function is represented as a factor graph and the max-product belief propagation is utilized to generate the solution insensitive to initialization and converged to the neighborhood maximum. Extensive experiments are conducted on multiple real-world datasets, which demonstrate the effectiveness and efficiency of our approach against the state-of-the-art approaches.","authors":["Chang-Dong Wang"],"citedInUrls":[],"refrenceUrls":["https://www.researchgate.net/publication/7799834_Combining_Multiple_Clusterings_Using_Evidence_Accumulation","https://www.researchgate.net/publication/51131073_A_Link-Based_Approach_to_the_Cluster_Ensemble_Problem","https://www.researchgate.net/publication/261490097_Robust_Ensemble_Clustering_by_Matrix_Completion","https://www.researchgate.net/publication/263012832_Hybrid_clustering_solution_selection_strategy","https://www.researchgate.net/publication/220907074_Weighted_Consensus_Clustering","https://www.researchgate.net/publication/224260807_DICLENS_Divisive_Clustering_Ensemble_with_Automatic_Cluster_Number","https://www.researchgate.net/publication/3080334_Factor_graphs_and_the_sum-product_algorithm_IEEE_Trans_Inf_Theory","https://www.researchgate.net/publication/6584052_Clustering_by_Passing_Messages_Between_Data_Points","https://www.researchgate.net/publication/220600805_Fast_affinity_propagation_clustering_A_multilevel_approach","https://www.researchgate.net/publication/236072169_Learning_Topic_Models_by_Belief_Propagation"],"citedInIDs":[],"refrenceIDs":[7799834,51131073,261490097,263012832,220907074,224260807,3080334,6584052,220600805,236072169],"pageRank":5.314734299140724E-4}
