{"id":281262237,"name":"ChIP-BIT: Bayesian inference of target genes using a novel joint probabilistic model of ChIP-seq profiles","abstraction":"We propose a novel approach WASP for Bayesian inference when massive size of the data prohibits posterior computations. WASP is estimated in three steps. First, data are divided into smaller computationally tractable subsets. Second, posterior draws of parameters are obtained for every subset after modifying subset posteriors using stochastic approximation. Finally, the empirical measures of samples from each subset posterior are combined through their barycenter in the Wasserstein space of probability measures. Stochastic approximation ensures that posterior uncertainty quantification of the barycenter matches with that of the full data posterior distribution. The combining step can be conducted efficiently through a sparse linear program, which takes negligible time relative to sampling from subset posteriors, facilitating scaling to massive data. WASP is very general and allows application of existing sampling algorithms to massive data with minimal modifications. We provide theoretical conditions under which rate of convergence of WASP to the delta measure centered at the true parameter coincides with the optimal parametric rate up to a logarithmic factor. WASP is applied for scalable Bayesian computations in a nonparametric mixture model and a movie recommender database containing tens of millions of ratings.","authors":["Sanvesh Srivastava"],"citedInUrls":[],"refrenceUrls":["https://www.researchgate.net/publication/228095582_Bayesian_Posterior_Sampling_via_Stochastic_Gradient_Fisher_Scoring","https://www.researchgate.net/publication/279236477_Package_Lme4_Linear_Mixed-Effects_Models_Using_Eigen_and_S4","https://www.researchgate.net/publication/38358774_Some_Asymptotic_Theory_for_the_Bootstrap","https://www.researchgate.net/publication/236255250_Nonparametric_Bayes_Modeling_of_Multivariate_Categorical_Data","https://www.researchgate.net/publication/2684281_Optimal_Maps_For_The_Multidimensional_Monge-Kantorovich_Problem","https://www.researchgate.net/publication/23528551_Prior_Distributions_for_Variance_Parameters_in_Hierarchical_Models","https://www.researchgate.net/publication/38348833_On_Convergence_of_Posterior_Distributions","https://www.researchgate.net/publication/243785736_Statistical_Estimation_Asymptotic_Theory","https://www.researchgate.net/publication/281058916_Approximations_of_Markov_Chains_and_High-Dimensional_Bayesian_Inference","https://www.researchgate.net/publication/261144450_Concentration_Inequalities_and_Model_Selection"],"citedInIDs":[],"refrenceIDs":[228095582,279236477,38358774,236255250,2684281,23528551,38348833,243785736,281058916,261144450],"pageRank":5.314734299140724E-4}
