{"id":282268529,"name":"Reliable ABC model choice via random forests","abstraction":"Approximate Bayesian Computation (ABC) is a powerful method for carrying out Bayesian inference when the likelihood is computationally intractable. However, a drawback of ABC is that it is an approximate method that induces a systematic error because it is necessary to set a tolerance level to make the computation tractable. The issue of how to optimally set this tolerance level has been the subject of extensive research. This paper proposes an ABC algorithm based on importance sampling that estimates expectations with respect to the exact posterior distribution given the observed summary statistics. This overcomes the need to select the tolerance level. By exact we mean that there is no systematic error and the Monte Carlo error can be made arbitrarily small by increasing the number of importance samples. We provide a formal justification for the method and study its convergence properties. The method is illustrated in two applications and the empirical results suggest that the proposed ABC based estimators consistently converge to the true values as the number of importance samples increases. Our proposed approach can be applied more generally to any importance sampling problem where an unbiased estimate of the likelihood is required.","authors":[],"citedInUrls":[],"refrenceUrls":["https://www.researchgate.net/publication/24168169_The_pseudo-marginal_approach_for_effcient_Monte_Carlo_computations","https://www.researchgate.net/publication/10954538_Approximate_Bayesian_Computation_in_Population_Genetics","https://www.researchgate.net/publication/257028465_On_non-negative_unbiased_estimators","https://www.researchgate.net/publication/8970227_Markov_Chain_Monte_Carlo_without_likelihoods","https://www.researchgate.net/publication/46461987_A_general_method_for_debiasing_a_Monte_Carlo","https://www.researchgate.net/publication/27468515_An_efficient_MCMC_method_for_distributions_with_intractable_normalising_constants","https://www.researchgate.net/publication/45894926_Likelihood-free_Markov_chain_Monte_Carlo","https://www.researchgate.net/publication/14140218_Inferring_Coalescence_Times_From_DNA_Sequence_Data","https://www.researchgate.net/publication/260957174_Importance_Sampling_Squared_for_Bayesian_Inference_in_Latent_Variable_Models"],"citedInIDs":[],"refrenceIDs":[24168169,10954538,257028465,8970227,46461987,27468515,45894926,14140218,260957174],"pageRank":5.314734299140724E-4}
