{"id":282310775,"name":"Presenting a new Ant Colony Optimization Algorithm (ACO) for Efficient Job Scheduling in Grid Environment","abstraction":"We study stochastic linear optimization problem with bandit feedback. The set of arms take values in an $N$-dimensional space and belong to a bounded polyhedron described by finitely many linear inequalities. We provide a lower bound for the expected regret that scales as $\\Omega(N\\log T)$. We then provide a nearly optimal algorithm and show that its expected regret scales as $O(N\\log^{1+\\epsilon}(T))$ for an arbitrary small $\\epsilon \u003e0$. The algorithm alternates between exploration and exploitation intervals sequentially where deterministic set of arms are played in the exploration intervals and greedily selected arm is played in the exploitation intervals. We also develop an algorithm that achieves the optimal regret when sub-Gaussianity parameter of the noise term is known. Our key insight is that for a polyhedron the optimal arm is robust to small perturbations in the reward function. Consequently, a greedily selected arm is guaranteed to be optimal when the estimation error falls below some suitable threshold. Our solution resolves a question posed by Rusmevichientong and Tsitsiklis (2011) that left open the possibility of efficient algorithms with asymptotic logarithmic regret bounds. We also show that the regret upper bounds hold with probability $1$. Our numerical investigations show that while theoretical results are asymptotic the performance of our algorithms compares favorably to state-of-the-art algorithms in finite time as well.","authors":["Manjesh K. Hanawal"],"citedInUrls":[],"refrenceUrls":["https://www.researchgate.net/publication/23670997_Linearly_Parameterized_Bandits","https://www.researchgate.net/publication/45903533_A_Contextual-Bandit_Approach_to_Personalized_News_Article_Recommendation","https://www.researchgate.net/publication/252069018_Recommender_Systems_An_Introduction","https://www.researchgate.net/publication/221497234_Stochastic_Linear_Optimization_under_Bandit_Feedback","https://www.researchgate.net/publication/220151284_Exploration-exploitation_tradeoff_using_variance_estimates_in_multi-armed_bandits","https://www.researchgate.net/publication/220343796_Finite-time_Analysis_of_the_Multiarmed_Bandit_Problem","https://www.researchgate.net/publication/220320997_Regret_Bounds_and_Minimax_Policies_under_Partial_Monitoring","https://www.researchgate.net/publication/239292007_Asymptotically_efficient_adaptive_allocation_rules1","https://www.researchgate.net/publication/220616937_The_Non-Stochastic_Multi-Armed_Bandit_Problem","https://www.researchgate.net/publication/201976486_Some_Aspects_of_the_Sequential_Design_of_Experiments"],"citedInIDs":[],"refrenceIDs":[23670997,45903533,252069018,221497234,220151284,220343796,220320997,239292007,220616937,201976486],"pageRank":5.314734299140724E-4}
