{"id":284579582,"name":"State Space representation of non-stationary Gaussian Processes","abstraction":"Latent variable time-series models are among the most heavily used tools from machine learning and applied statistics. These models have the advantage of learning latent structure both from noisy observations and from the temporal ordering in the data, where it is assumed that meaningful correlation structure exists across time. A few highly-structured models, such as the linear dynamical system with linear-Gaussian observations, have closed-form inference procedures (e.g. the Kalman Filter), but this case is an exception to the general rule that exact posterior inference in more complex generative models is intractable. Consequently, much work in time-series modeling focuses on approximate inference procedures for one particular class of models. Here, we extend recent developments in stochastic variational inference to develop a `black-box\u0027 approximate inference technique for latent variable models with latent dynamical structure. We propose a structured Gaussian variational approximate posterior that carries the same intuition as the standard Kalman filter-smoother but, importantly, permits us to use the same inference approach to approximate the posterior of much more general, nonlinear latent variable generative models. We show that our approach recovers accurate estimates in the case of basic models with closed-form posteriors, and more interestingly performs well in comparison to variational approaches that were designed in a bespoke fashion for specific non-conjugate models.","authors":["Lars Buesing","John Cunningham","Liam Paninski"],"citedInUrls":[],"refrenceUrls":["https://www.researchgate.net/publication/268370482_Spectral_learning_of_linear_dynamics_from_generalised-linear_observations_with_application_to_neural_population_data","https://www.researchgate.net/publication/277959228_A_Recurrent_Latent_Variable_Model_for_Sequential_Data","https://www.researchgate.net/publication/237053929_Fast_Dual_Variational_Inference_for_Non-Conjugate_LGMs","https://www.researchgate.net/publication/27240597_Numerically_Stable_Algorithms_for_Inversion_of_Block_Tridiagonal_and_Banded_Matrices","https://www.researchgate.net/publication/277023018_Variational_Inference_with_Normalizing_Flows","https://www.researchgate.net/publication/269935079_Adam_A_Method_for_Stochastic_Optimization","https://www.researchgate.net/publication/262991675_Stochastic_Backpropagation_and_Approximate_Inference_in_Deep_Generative_Models","https://www.researchgate.net/publication/280587974_Single-trial_dynamics_of_motor_cortex_and_their_applications_to_brain-machine_interfaces","https://www.researchgate.net/publication/263316327_Semi-Supervised_Learning_with_Deep_Generative_Models","https://www.researchgate.net/publication/233753224_Theano_new_features_and_speed_improvements"],"citedInIDs":[],"refrenceIDs":[268370482,277959228,237053929,27240597,277023018,269935079,262991675,280587974,263316327,233753224],"pageRank":5.314734299140724E-4}
