{"id":284579051,"name":"Improving Traffic Conditions by Using Neural Networks","abstraction":"We introduce the \"exponential linear unit\" (ELU) which speeds up learning in deep neural networks and leads to higher classification accuracies. Like rectified linear units (ReLUs), leaky ReLUs (LReLUs) and parameterized ReLUs (PReLUs), ELUs also avoid a vanishing gradient via the identity for positive values. However, ELUs have improved learning characteristics compared to the units with other activation functions. In contrast to ReLUs, ELUs have negative values which allows them to push mean unit activations closer to zero. Zero means speed up learning because they bring the gradient closer to the unit natural gradient. We show that the unit natural gradient differs from the normal gradient by a bias shift term, which is proportional to the mean activation of incoming units. Like batch normalization, ELUs push the mean towards zero, but with a significantly smaller computational footprint. While other activation functions like LReLUs and PReLUs also have negative values, they do not ensure a noise-robust deactivation state. ELUs saturate to a negative value with smaller inputs and thereby decrease the propagated variation and information. Therefore, ELUs code the degree of presence of particular phenomena in the input, while they do not quantitatively model the degree of their absence. Consequently, dependencies between ELUs are much easier to model and distinct concepts are less likely to interfere. We found that ELUs lead not only to faster learning, but also to better generalization performance once networks have many layers (\u003e\u003d 5). Using ELUs, we obtained the best published single-crop result on CIFAR-100 and CIFAR-10. On ImageNet, ELU networks considerably speed up learning compared to a ReLU network with similar classification performance, obtaining less than 10% classification error for a single crop, single model network.","authors":["Sepp Hochreiter"],"citedInUrls":[],"refrenceUrls":["https://www.researchgate.net/publication/220499716_Statistical_Theory_of_Learning_Curves_under_Entropic_Loss_Criterion","https://www.researchgate.net/publication/2433873_Natural_Gradient_Works_Efficiently_in_Learning","https://www.researchgate.net/publication/266463521_Improved_Preconditioner_for_Hessian_Free_Optimization","https://www.researchgate.net/publication/221345086_Enhanced_Gradient_and_Adaptive_Learning_Rate_for_Training_Restricted_Boltzmann_Machines","https://www.researchgate.net/publication/2585470_Natural_Gradient_Learning_With_A_Nonholonomic_Constraint_For_Blind_Deconvolution_Of_Multiple_Channels","https://www.researchgate.net/publication/272752025_Rectified_Factor_Networks","https://www.researchgate.net/publication/215616967_Deep_Sparse_Rectifier_Neural_Networks","https://www.researchgate.net/publication/221619376_A_Natural_Policy_Gradient","https://www.researchgate.net/publication/267960550_ImageNet_Classification_with_Deep_Convolutional_Neural_Networks","https://www.researchgate.net/publication/2372487_Iterative_Weighted_Least_Squares_Algorithms_For_Neural_Networks_Classifiers"],"citedInIDs":[],"refrenceIDs":[220499716,2433873,266463521,221345086,2585470,272752025,215616967,221619376,267960550,2372487],"pageRank":5.314734299140724E-4}
