{"id":286513408,"name":"Bayesian analysis of a linear model involving structural changes in either regression parameters or disturbances precision","abstraction":"In Bayesian analysis, the posterior follows from the data and a choice of a prior and a likelihood. One hopes that the posterior is robust to reasonable variation in the choice of prior and likelihood, since this choice is made by the modeler and is necessarily somewhat subjective. Despite the fundamental importance of the problem and a considerable body of literature, the tools of robust Bayes are not commonly used in practice. This is in large part due to the difficulty of calculating robustness measures from MCMC draws. Although methods for computing robustness measures from MCMC draws exist, they lack generality and often require additional coding or computation. In contrast to MCMC, variational Bayes (VB) techniques are readily amenable to robustness analysis. The derivative of a posterior expectation with respect to a prior or data perturbation is a measure of local robustness to the prior or likelihood. Because VB casts posterior inference as an optimization problem, its methodology is built on the ability to calculate derivatives of posterior quantities with respect to model parameters, even in very complex models. In the present work, we develop local prior robustness measures for mean-field variational Bayes(MFVB), a VB technique which imposes a particular factorization assumption on the variational posterior approximation. We start by outlining existing local prior measures of robustness. Next, we use these results to derive closed-form measures of the sensitivity of mean-field variational posterior approximation to prior specification. We demonstrate our method on a meta-analysis of randomized controlled interventions in access to microcredit in developing countries.","authors":["Tamara Broderick"],"citedInUrls":[],"refrenceUrls":["https://www.researchgate.net/publication/284477399_Variational_Inference_for_Dirichlet_Process_Mixtures","https://www.researchgate.net/publication/262157385_Latent_Dirichlet_Allocation","https://www.researchgate.net/publication/46515700_MCMC_methods_for_multi-response_Generalised_Linear_Mixed_Models_the_MCMCglmm_R_package","https://www.researchgate.net/publication/228092206_Stochastic_Variational_Inference","https://www.researchgate.net/publication/11428922_Mean-Field_Approaches_to_Independent_Component_Analysis","https://www.researchgate.net/publication/220500257_Efficient_Learning_in_Boltzmann_Machines_Using_Linear_Response_Theory","https://www.researchgate.net/publication/2985446_Gradient-based_learning_applied_to_document_recognition_Proc_IEEE","https://www.researchgate.net/publication/220695762_InformationTheory_Inference_and_Learning_Algorithms","https://www.researchgate.net/publication/236853450_Using_EM_to_Obtain_Asymptotic_Variance-covariance_Matrices_The_SEM_Algorithm","https://www.researchgate.net/publication/40498220_Advanced_Mean_Field_Methods_Theory_and_Practice"],"citedInIDs":[],"refrenceIDs":[284477399,262157385,46515700,228092206,11428922,220500257,2985446,220695762,236853450,40498220],"pageRank":5.314734299140724E-4}
