{"id":288713874,"name":"Investigating the performance of AIC in selecting phylogenetic models","abstraction":"Understanding the processes that give rise to quantitative measurements associated with molecular sequence data remains an important issue in statistical phylogenetics. Examples of such measurements include geographic coordinates in the context of phylogeography and phenotypic traits in the context of comparative studies. A popular approach is to model the evolution of continuously varying traits as a Brownian diffusion process. However, standard Brownian diffusion is quite restrictive and may not accurately characterize certain trait evolutionary processes. Here, we relax one of the major restrictions of standard Brownian diffusion by incorporating a nontrivial estimable drift into the process. We introduce a relaxed drift diffusion model for the evolution of multivariate continuously varying traits along a phylogenetic tree via Brownian diffusion with drift. Notably, the relaxed drift model accommodates branch-specific variation of drift rates while preserving model identifiability. We implement the relaxed drift model in a Bayesian inference framework to simultaneously reconstruct the evolutionary histories of molecular sequence data and associated multivariate continuous trait data, and provide tools to visualize evolutionary reconstructions. We illustrate our approach in three viral examples. In the first two, we examine the spatiotemporal spread of HIV-1 in central Africa and West Nile virus in North America and show that a relaxed drift approach uncovers a clearer, more detailed picture of the dynamics of viral dispersal than standard Brownian diffusion. Finally, we study antigenic evolution in the context of HIV-1 resistance to three broadly neutralizing antibodies. Our analysis reveals evidence of a continuous drift at the HIV-1 population level towards enhanced resistance to neutralization by the VRC01 monoclonal antibody over the course of the epidemic.","authors":["Mandev S. Gill","Guy Baele","Marc A. Suchard"],"citedInUrls":[],"refrenceUrls":["https://www.researchgate.net/publication/221818024_Phylogeography_and_Population_Dynamics_of_Dengue_Viruses_in_the_Americas","https://www.researchgate.net/publication/237839453_Bayesian_evolutionary_model_testing_in_the_phylogenomics_era_Matching_model_complexity_with_computational_efficiency","https://www.researchgate.net/publication/221689131_Improving_the_Accuracy_of_Demographic_and_Molecular_Clock_Model_Comparison_While_Accommodating_Phylogenetic_Uncertainty","https://www.researchgate.net/publication/232611428_Accurate_Model_Selection_of_Relaxed_Molecular_Clocks_in_Bayesian_Phylogenetics","https://www.researchgate.net/publication/230782497_A_comparative_method_for_studying_multivariate_adaptation_J_Theor_Biol","https://www.researchgate.net/publication/260108438_Integrating_influenza_antigenic_dynamics_with_molecular_evolution","https://www.researchgate.net/publication/40452855_Epidemic_Dynamics_Revealed_in_Dengue_Evolution","https://www.researchgate.net/publication/6358903_A_high-resolution_genetic_signature_of_demographic_and_spatial_expansion_in_epizootic_rabies_virus_Proc_Natl_Acad_Sci_USA","https://www.researchgate.net/publication/8143048_Genetic_Subtyping_of_gag_and_env_Regions_of_HIV_Type_1_Isolates_in_Republic_of_Congo","https://www.researchgate.net/publication/12525244_Genetic_Subtypes_of_HIV_Type_1_in_Republic_of_Congo"],"citedInIDs":[],"refrenceIDs":[221818024,237839453,221689131,232611428,230782497,260108438,40452855,6358903,8143048,12525244],"pageRank":5.314734299140724E-4}
