{"id":288889800,"name":"Big Data Analytics \u003d Machine Learning + Cloud Computing","abstraction":"The rise of Big Data has led to new demands for Machine Learning (ML) systems to learn complex models with millions to billions of parameters, that promise adequate capacity to digest massive datasets and offer powerful predictive analytics thereupon. In order to run ML algorithms at such scales, on a distributed cluster with 10s to 1000s of machines, it is often the case that significant engineering efforts are required --- and one might fairly ask if such engineering truly falls within the domain of ML research or not. Taking the view that Big ML systems can benefit greatly from ML-rooted statistical and algorithmic insights --- and that ML researchers should therefore not shy away from such systems design --- we discuss a series of principles and strategies distilled from our recent efforts on industrial-scale ML solutions. These principles and strategies span a continuum from application, to engineering, and to theoretical research and development of Big ML systems and architectures, with the goal of understanding how to make them efficient, generally-applicable, and supported with convergence and scaling guarantees. They concern four key questions which traditionally receive little attention in ML research: How to distribute an ML program over a cluster? How to bridge ML computation with inter-machine communication? How to perform such communication? What should be communicated between machines? By exposing underlying statistical and algorithmic characteristics unique to ML programs but not typically seen in traditional computer programs, and by dissecting successful cases to reveal how we have harnessed these principles to design and develop both high-performance distributed ML software as well as general-purpose ML frameworks, we present opportunities for ML researchers and practitioners to further shape and grow the area that lies between ML and systems.","authors":["Eric P. Xing","Qirong Ho","Wei Dai"],"citedInUrls":[],"refrenceUrls":["https://www.researchgate.net/publication/261051511_Distributed_delayed_stochastic_optimization","https://www.researchgate.net/publication/221520030_Scalable_inference_in_latent_variable_models","https://www.researchgate.net/publication/221022199_Unified_analysis_of_streaming_news","https://www.researchgate.net/publication/279903864_Mixed_Membership_Stochastic_Blockmodels","https://www.researchgate.net/publication/228671354_Large-scale_machine_learning_with_stochastic_gradient_descent_In_COMPSTAT","https://www.researchgate.net/publication/51893532_Parallel_Coordinate_Descent_for_L1-Regularized_Loss_Minimization","https://www.researchgate.net/publication/263377753_A_Tutorial_on_Support_Vector_Machines_for_Pattern_Recognition","https://www.researchgate.net/publication/220565847_Anomaly_Detection_A_Survey","https://www.researchgate.net/publication/287762956_Deep_learning_with_COTS_HPC_systems","https://www.researchgate.net/publication/267627408_High-Performance_Distributed_ML_at_Scale_through_Parameter_Server_Consistency_Models"],"citedInIDs":[],"refrenceIDs":[261051511,221520030,221022199,279903864,228671354,51893532,263377753,220565847,287762956,267627408],"pageRank":5.314734299140724E-4}
