{"id":291186593,"name":"Semantics, Representations and Grammars for Deep Learning","abstraction":"Deep learning is currently the subject of intensive study. However, fundamental concepts such as representations are not formally defined -- researchers \"know them when they see them\" -- and there is no common language for describing and analyzing algorithms. This essay proposes an abstract framework that identifies the essential features of current practice and may provide a foundation for future developments. The backbone of almost all deep learning algorithms is backpropagation, which is simply a gradient computation distributed over a neural network. The main ingredients of the framework are thus, unsurprisingly: (i) game theory, to formalize distributed optimization; and (ii) communication protocols, to track the flow of zeroth and first-order information. The framework allows natural definitions of semantics (as the meaning encoded in functions), representations (as functions whose semantics is chosen to optimized a criterion) and grammars (as communication protocols equipped with first-order convergence guarantees). Much of the essay is spent discussing examples taken from the literature. The ultimate aim is to develop a graphical language for describing the structure of deep learning algorithms that backgrounds the details of the optimization procedure and foregrounds how the components interact. Inspiration is taken from probabilistic graphical models and factor graphs, which capture the essential structural features of multivariate distributions.","authors":[],"citedInUrls":[],"refrenceUrls":["https://www.researchgate.net/publication/230812882_What_can_neurons_do_for_their_brain_Communicate_selectivity_with_bursts","https://www.researchgate.net/publication/220343680_Toward_a_Model_of_Intelligence_as_an_Economy_of_Agents","https://www.researchgate.net/publication/232065352_Twenty-Five_Lessons_from_Computational_Neuromodulation","https://www.researchgate.net/publication/270410909_A_Survey_on_Policy_Search_for_Robotics","https://www.researchgate.net/publication/220344042_Riedmiller_M_Reinforcement_learning_in_feedback_control_Challenges_and_benchmarks_from_technical_process_control_Machine_Learning_841-2_137-169","https://www.researchgate.net/publication/245195192_Adaptive_critic_designs_and_their_applications","https://www.researchgate.net/publication/222695781_Learning_correlated_equilibria_in_games_with_compact_sets_of_strategies","https://www.researchgate.net/publication/225264698_Learning_to_Predict_by_the_Method_of_Temporal_Differences","https://www.researchgate.net/publication/228433603_Graphical_models_exponential_families_and_variational_methods","https://www.researchgate.net/publication/221345670_Residual_Algorithms_Reinforcement_Learning_with_Function_Approximation"],"citedInIDs":[],"refrenceIDs":[230812882,220343680,232065352,270410909,220344042,245195192,222695781,225264698,228433603,221345670],"pageRank":5.314734299140724E-4}
