{"id":38365933,"name":"Verification of the Validity of the NPT Treatment in Hereditary Spastic Paraplegia: An Ivestigation Performed by Application of Random Matrix Theory","abstraction":"The paper is largely expository, but some new results are included to round out the paper and bring it up to date. The following distributions are quoted in Section 7. 1. Type $_0F_0$, exponential: (i) $\\chi^2$, (ii) Wishart, (iii) latent roots of the covariance matrix. 2. Type $_1F_0$, binomial series: (i) variance ratio, $F$, (ii) latent roots with unequal population covariance matrices. 3. Type $_0F_1$, Bessel: (i) noncentral $\\chi^2$, (ii) noncentral Wishart, (iii) noncentral means with known covariance. 4. Type $_1F_1$, confluent hypergeometric: (i) noncentral $F$, (ii) noncentral multivariate $F$, (iii) noncentral latent roots. 5. Type $_2F_1$, Gaussian hypergeometric: (i) multiple correlation coefficient, (ii) canonical correlation coefficients. The modifications required for the corresponding distributions derived from the complex normal distribution are outlined in Section 8, and the distributions are listed. The hypergeometric functions $_pF_q$ of matrix argument which occur in the multivariate distributions are defined in Section 4 by their expansions in zonal polynomials as defined in Section 5. Important properties of zonal polynomials and hypergeometric functions are quoted in Section 6. Formulae and methods for the calculation of zonal polynomials are given in Section 9 and the zonal polynomials up to degree 6 are given in the appendix. The distribution of quadratic forms is discussed in Section 10, orthogonal expansions of $_0F_0$ and $_1F_1$ in Laguerre polynomials in Section 11 and the asymptotic expansion of $_0F_0$ in Section 12. Section 13 has some formulae for moments.","authors":["Alan T. James"],"citedInUrls":["https://www.researchgate.net/publication/286029296_Verification_of_the_Validity_of_the_NPT_Treatment_in_Hereditary_Spastic_Paraplegia_An_Ivestigation_Performed_by_Application_of_Random_Matrix_Theory","https://www.researchgate.net/publication/283494508_The_largest_eigenvalue_distribution_of_the_Laguerre_unitary_ensemble","https://www.researchgate.net/publication/280772804_Asymptotic_Matrix_Variate_von-Mises_Fisher_and_Bingham_Distributions_with_Applications"],"refrenceUrls":[],"citedInIDs":[286029296,283494508,280772804],"refrenceIDs":[],"pageRank":0.002094306217077878}
