{"id":38367703,"name":"Modified classes of estimators in circular systematic sampling","abstraction":"In an earlier paper, [1] an approach to the problem of systematic sampling was formulated, and the associated variance obtained. Several forms of the population were assumed. The efficiency of the systematic design as compared with the random and stratified random design was evaluated for these forms. It was remarked that as the size of sample increased the variance of a systematic design might also increase, contrary to the behavior of variances in the random sampling design. This possibility was verified in [2]. One approach to the study of systematic designs, given by Cochran [3] removed this difficulty to some extent by changing the problem to one of the expected variance, and supposing the elements of the population to be random variables. He showed that if the correlogram of these random variables is concave upwards, then the expected variance of the systematic design would be less, and often considerably less, than the variance of a stratified design. In the present paper the results of the earlier papers are extended to the systematic sampling of clusters of equal and unequal sizes. Some comments on systematic sampling in two dimensions are included. In section 2 we derive two theorems that have considerable applications in many parts of sampling. Although it has been common for people working in sampling theory to tell each other that these theorems ought to be true, yet no reference seems to exist. In section 3 we develop the implications of a remark [1, p. 13] that in designing sample surveys we should try to induce negative correlation between strata. In Theorem 3 we obtain sufficient conditions for the correlation to be negative. The lemma and Theorem 4 given in Section 4 enable us to extend the uses of Theorem 3 in practice. As an application of these results, we show that if a population has a concave upwards correlogram, and if strata are defined in an optimum fashion for the selection of one element at random from each stratum, then we can define a systematic type design that will be more efficient than independent random selection from each stratum. In sections 5 and 6 we obtain various results in the systematic sampling of clusters largely as applications of the more general theorems of the earlier sections. In general the results are of a nature similar to those of [1] and [3] in that the formulae show the conditions under which systematic sampling may be expected to be more efficient than random or stratified random sampling. We have not, however, applied these formulae to specified types of populations. From [1, 2 and 3] it is already apparent that this work will be useful and such studies should be more valuable when made in connection with important types of surveys or data than when made as illustrations in a general paper.","authors":["William G. Madow"],"citedInUrls":["https://www.researchgate.net/publication/281563933_Modified_classes_of_estimators_in_circular_systematic_sampling","https://www.researchgate.net/publication/259359014_A_Simplified_Selection_Scheme_for_Unequal_Probability_Sampling_Without_Replacement","https://www.researchgate.net/publication/264098550_Mutual_Localization_of_swarm_robot_using_Particle_Filter"],"refrenceUrls":[],"citedInIDs":[281563933,259359014,264098550],"refrenceIDs":[],"pageRank":9.324986433659398E-4}
