{"id":38363224,"name":"Genetic consequences of human forest exploitation in two colobus monkeys in Guinea Bissau","abstraction":"The Gibbs sampler, the algorithm of Metropolis and similar iterative simulation methods are potentially very helpful for summarizing multivariate distributions. Used naively, however, iterative simulation can give misleading answers. Our methods are simple and generally applicable to the output of any iterative simulation; they are designed for researchers primarily interested in the science underlying the data and models they are analyzing, rather than for researchers interested in the probability theory underlying the iterative simulations themselves. Our recommended strategy is to use several independent sequences, with starting points sampled from an overdispersed distribution. At each step of the iterative simulation, we obtain, for each univariate estimand of interest, a distributional estimate and an estimate of how much sharper the distributional estimate might become if the simulations were continued indefinitely. Because our focus is on applied inference for Bayesian posterior distributions in real problems, which often tend toward normality after transformations and marginalization, we derive our results as normal-theory approximations to exact Bayesian inference, conditional on the observed simulations. The methods are illustrated on a random-effects mixture model applied to experimental measurements of reaction times of normal and schizophrenic patients.","authors":["Andrew Gelman"],"citedInUrls":["https://www.researchgate.net/publication/288933242_Genetic_consequences_of_human_forest_exploitation_in_two_colobus_monkeys_in_Guinea_Bissau","https://www.researchgate.net/publication/272565757_ANALYSIS_OF_APPENDECTOMY_IN_BELGIUM_USING_DISEASE_MAPPING_TECHNIQUES","https://www.researchgate.net/publication/287419720_Involvement_of_Sensory_Regions_in_Affective_Experience_A_Meta-Analysis"],"refrenceUrls":["https://www.researchgate.net/publication/245071851_A_single_series_from_the_Gibbs_sampler_provides_a_false_sense_of_security","https://www.researchgate.net/publication/224910629_Sampling-Based_Approaches_to_Calculate_Marginal_Densities","https://www.researchgate.net/publication/220182914_Geman_D_Stochastic_relaxation_Gibbs_distribution_and_the_Bayesian_restoration_of_images_IEEE_Trans_Pattern_Anal_Mach_Intell_PAMI-66_721-741","https://www.researchgate.net/publication/200105001_Equation_of_State_by_Fast_Computing_Machines","https://www.researchgate.net/publication/243689785_Illustration_of_Bayesian_Inference_in_Normal_Data_Models_Using_Gibbs_Sampling"],"citedInIDs":[288933242,272565757,287419720],"refrenceIDs":[245071851,224910629,220182914,200105001,243689785],"pageRank":0.003170404872259116}
