{"id":46537493,"name":"An intuitive Bayesian spatial model for disease mapping that accounts for scaling","abstraction":"Structured additive regression models are perhaps the most commonly used class of models in statistical applications. It includes, among others, (generalized) linear models, (generalized) additive models, smoothing spline models, state space models, semiparametric regression, spatial and spatiotemporal models, log-Gaussian Cox processes and geostatistical and geoadditive models. We consider approximate Bayesian inference in a popular subset of structured additive regression models, \"latent Gaussian models\", where the latent field is Gaussian, controlled by a few hyperparameters and with non-Gaussian response variables. The posterior marginals are not available in closed form owing to the non-Gaussian response variables. For such models, Markov chain Monte Carlo methods can be implemented, but they are not without problems, in terms of both convergence and computational time. In some practical applications, the extent of these problems is such that Markov chain Monte Carlo sampling is simply not an appropriate tool for routine analysis. We show that, by using an integrated nested Laplace approximation and its simplified version, we can directly compute very accurate approximations to the posterior marginals. The main benefit of these approximations is computational: where Markov chain Monte Carlo algorithms need hours or days to run, our approximations provide more precise estimates in seconds or minutes. Another advantage with our approach is its generality, which makes it possible to perform Bayesian analysis in an automatic, streamlined way, and to compute model comparison criteria and various predictive measures so that models can be compared and the model under study can be challenged. Copyright (c) 2009 Royal Statistical Society.","authors":["Sara Martino"],"citedInUrls":["https://www.researchgate.net/publication/289527648_An_intuitive_Bayesian_spatial_model_for_disease_mapping_that_accounts_for_scaling","https://www.researchgate.net/publication/287853895_Bayesian_bivariate_meta-analysis_of_diagnostic_test_studies_with_interpretable_priors","https://www.researchgate.net/publication/286513408_Robust_Inference_with_Variational_Bayes"],"refrenceUrls":["https://www.researchgate.net/publication/242530111_Bayesian_Analysis_of_Binary_and_Polychotomous_Response_Data","https://www.researchgate.net/publication/2280218_Keeping_Neural_Networks_Simple_by_Minimizing_the_Description_Length_of_the_Weights","https://www.researchgate.net/publication/243620229_Accurate_Approximations_for_Posterior_Moments_and_Marginal_Densities_-_JASA_81_82-86","https://www.researchgate.net/publication/27470281_Efficient_recursions_for_general_factorisable_models","https://www.researchgate.net/publication/23660469_Approximate_Likelihood_for_Large_Irregularly_Spaced_Spatial_Data","https://www.researchgate.net/publication/243770509_Model_Determination_using_Sampling-based_Methods","https://www.researchgate.net/publication/225560576_Hierarchical_Modeling_and_Analysis_for_Spatial_Data","https://www.researchgate.net/publication/6380816_An_Estimating_Function_Approach_to_Inference_for_Inhomogeneous_Neyman-Scott_Processes","https://www.researchgate.net/publication/12360850_Bayesian_modelling_of_inseparable_space-time_variation_in_disease_risk","https://www.researchgate.net/publication/220320873_Gaussian_Processes_for_Ordinal_Regression"],"citedInIDs":[289527648,287853895,286513408],"refrenceIDs":[242530111,2280218,243620229,27470281,23660469,243770509,225560576,6380816,12360850,220320873],"pageRank":6.176095231463132E-4}
