{"id":4746782,"name":"A time dependent Bayesian nonparametric model for air quality analysis","abstraction":"We consider dependent nonparametric models for related random probability distributions. For example, the random distributions might be indexed by a categorical covariate indicating the treatment levels in a clinical trial and might represent random effects distributions under the respective treatment combinations. We propose a model that describes dependence across random distributions in an analysis of variance (ANOVA)-type fashion. We define a probability model in such a way that marginally each random measure follows a Dirichlet process (DP) and use the dependent Dirichlet process to define the desired dependence across the related random measures. The resulting probability model can alternatively be described as a mixture of ANOVA models with a DP prior on the unknown mixing measure. The main features of the proposed approach are ease of interpretation and computational simplicity. Because the model follows the standard ANOVAstructure, interpretation and inference parallels conventions for ANOVA models. This includes the notion of main effects, interactions, contrasts, and the like. Of course, the analogies are limited to structure and interpretation. The actual objects of the inference are random distributions instead of the unknown normal means in standard ANOVA models. Besides interpretation and model structure, another important feature of the proposed approach is ease of posterior simulation. Because the model can be rewritten as a DP mixture of ANOVAmodels, it inherits all computational advantages of standard DP mixture models. This includes availability of efficient Gibbs sampling schemes for posterior simulation and ease of implementation of even high-dimensional applications. Complexity of implementing posterior simulation is - at least conceptually - dimension independent.","authors":["Maria De Iorio","Peter Muller","Gary L. Rosner"],"citedInUrls":["https://www.researchgate.net/publication/283282369_A_time_dependent_Bayesian_nonparametric_model_for_air_quality_analysis","https://www.researchgate.net/publication/280050382_Joint_estimation_of_quantile_planes_over_arbitrary_predictor_spaces","https://www.researchgate.net/publication/270273634_A_Dependent_Bayesian_Nonparametric_Model_for_Test_Equating"],"refrenceUrls":["https://www.researchgate.net/publication/223053371_Mixtures_of_Dirichlet_process_priors_for_variable_selection_in_survival_analysis","https://www.researchgate.net/publication/24052625_Nonparametric_Bayesian_Modeling_for_Stochastic_Order","https://www.researchgate.net/publication/38322273_Markov_Chain_Monte_Carlo_Estimation_of_the_Law_of_the_Mean_of_a_Dirichlet_Process","https://www.researchgate.net/publication/226062141_A_bayesian_predictive_approach_to_sequential_search_for_an_optimal_dose_Parametric_and_nonparametric_models"],"citedInIDs":[283282369,280050382,270273634],"refrenceIDs":[223053371,24052625,38322273,226062141],"pageRank":6.702415538144006E-4}
