{"id":51956659,"name":"Recycling intermediate steps to improve Hamiltonian Monte Carlo","abstraction":"Hamiltonian Monte Carlo (HMC) is a Markov chain Monte Carlo (MCMC) algorithm that avoids the random walk behavior and sensitivity to correlated parameters that plague many MCMC methods by taking a series of steps informed by first-order gradient information. These features allow it to converge to high-dimensional target distributions much more quickly than simpler methods such as random walk Metropolis or Gibbs sampling. However, HMC\u0027s performance is highly sensitive to two user-specified parameters: a step size {\\epsilon} and a desired number of steps L. In particular, if L is too small then the algorithm exhibits undesirable random walk behavior, while if L is too large the algorithm wastes computation. We introduce the No-U-Turn Sampler (NUTS), an extension to HMC that eliminates the need to set a number of steps L. NUTS uses a recursive algorithm to build a set of likely candidate points that spans a wide swath of the target distribution, stopping automatically when it starts to double back and retrace its steps. Empirically, NUTS perform at least as efficiently as and sometimes more efficiently than a well tuned standard HMC method, without requiring user intervention or costly tuning runs. We also derive a method for adapting the step size parameter {\\epsilon} on the fly based on primal-dual averaging. NUTS can thus be used with no hand-tuning at all. NUTS is also suitable for applications such as BUGS-style automatic inference engines that require efficient \"turnkey\" sampling algorithms.","authors":["Matthew D. Hoffman","Andrew Gelman"],"citedInUrls":["https://www.researchgate.net/publication/284579096_Recycling_intermediate_steps_to_improve_Hamiltonian_Monte_Carlo","https://www.researchgate.net/publication/283043210_A_General_Method_for_Robust_Bayesian_Modeling","https://www.researchgate.net/publication/281145119_Non-Stationary_Gaussian_Process_Regression_with_Hamiltonian_Monte_Carlo"],"refrenceUrls":["https://www.researchgate.net/publication/200175478_Simulating_Hamiltonian_Dynamics","https://www.researchgate.net/publication/222018937_Hybrid_Monte_Carlo","https://www.researchgate.net/publication/45897328_Optimal_tuning_of_the_Hybrid_Monte-Carlo_Algorithm","https://www.researchgate.net/publication/12826203_Some_adaptive_Monte_Carlo_methods_for_Bayesian_inference","https://www.researchgate.net/publication/1990414_An_Improved_Acceptance_Procedure_for_the_Hybrid_Monte_Carlo_Algorithm","https://www.researchgate.net/publication/13330566_Global_Monte_Carlo_algorithms_for_many-fermion_systems"],"citedInIDs":[284579096,283043210,281145119],"refrenceIDs":[200175478,222018937,45897328,12826203,1990414,13330566],"pageRank":8.728682659288976E-4}
